Repository: LQDJudge/online-judge
Catalog: locale/*/LC_MESSAGES/django.po
Languages: vi

source: Teacher Feedback
vi: Nhận xét của giáo viên

source: Quiz search
vi: Tìm kiếm bài kiểm tra

source: Search quizzes...
vi: Tìm kiếm bài kiểm tra...

source: Number of Attempts
vi: Số lượt làm bài

source: Count
vi: Số lượng

source: Score Range
vi: Khoảng điểm

source: attempts
vi: lượt làm

source: Export Grades (CSV)
vi: Xuất điểm (CSV)

source: Unique Users
vi: Số người dùng

source: Std Deviation
vi: Độ lệch chuẩn

source: Score Distribution
vi: Phân bố điểm

source: No data available for score distribution.
vi: Chưa có dữ liệu phân bố điểm.

source: Your progress will be saved, but are you sure you want to leave?
vi: Tiến độ của bạn sẽ được lưu, nhưng bạn có chắc muốn rời đi?

source: Saved
vi: Đã lưu

source: Error saving
vi: Lỗi lưu dữ liệu

source: Time expired. Your quiz will be submitted.
vi: Hết thời gian. Bài kiểm tra của bạn sẽ được nộp.

source: Time is up!
vi: Hết thời gian!

source: Uploading...
vi: Đang tải lên...

source: Are you sure you want to delete this file?
vi: Bạn có chắc muốn xóa file này?

source: File size exceeds 10 MB limit.
vi: Kích thước file vượt quá giới hạn 10 MB.

source: Upload failed:
vi: Tải lên thất bại:

source: Unknown error
vi: Lỗi không xác định

source: Upload failed
vi: Tải lên thất bại

source: Delete failed:
vi: Xóa thất bại:

source: Delete failed
vi: Xóa thất bại

source: Enter your answer...
vi: Nhập câu trả lời của bạn...

source: Enter your essay response...
vi: Nhập bài luận của bạn...

source: Drag files here or click to upload
vi: Kéo file vào đây hoặc nhấp để tải lên

source: Allowed: PDF, DOC, DOCX, TXT, RTF, ODT, images, ZIP. Max 10MB per file.
vi: Cho phép: PDF, DOC, DOCX, TXT, RTF, ODT, ảnh, ZIP. Tối đa 10MB mỗi file.

source: Make sure you have answered all questions before submitting.
vi: Hãy chắc chắn bạn đã trả lời tất cả câu hỏi trước khi nộp bài.

source: Submit Quiz
vi: Nộp bài kiểm tra

source: Recent groups
vi: Nhóm gần đây

source: %(key)s is an invalid activation key.
vi: %(key)s không phải mã xác thực hợp lệ.

source: Your account has been successfully activated.
vi: Tài khoản được kích hoạt thành công.

source: Account activation
vi: Kích hoạt tài khoản

source: Thanks for registering! We're glad to have you. The last step is activating your account. Please activate your account in the next %(expiration_days)d days.
vi: Cảm ơn bạn đã đăng ký! Chúng tôi rất vui được chào đón bạn. Bước cuối cùng là kích hoạt tài khoản của bạn. Vui lòng kích hoạt tài khoản trong vòng %(expiration_days)d ngày.

source: Activate
vi: Kích hoạt

source: Alternatively, you can reply to this message to activate your account. Your reply must keep the following text intact for this to work:
vi: Hoặc bạn có thể trả lời tin nhắn này để kích hoạt tài khoản của bạn. Email trả lời của bạn phải giữ nguyên đoạn văn sau đây:

source: See you soon!
vi: Hẹn sớm gặp lại bạn!

source: Activate your %(SITE_NAME)s account
vi: Kích hoạt tài khoản %(SITE_NAME)s

source: Invalid username/email or password.
vi: Tên đăng nhập/email hoặc mật khẩu không hợp lệ.

source: Login!
vi: Đăng nhập!

source: Forgot your password?
vi: Quên mật khẩu?

source: Or log in with...
vi: Đăng nhập với...

source: See you later!
vi: Hẹn gặp lại!

source: Your password was sucessfully changed.
vi: Đổi mật khẩu thành công.

source: Change Password
vi: Đổi mật khẩu

source: Send Reset Email
vi: Gửi email reset

source: Your password has been set. You may go ahead and log in now
vi: Mật khẩu đã được cập nhật. Hãy thử đăng nhập lại

source: Reset Password
vi: Reset mật khẩu

source: We've emailed you instructions for setting your password. You should be receiving them shortly.
vi: Chúng tôi đã gửi email cho bạn để đặt lại mật khẩu.

source: If you don't receive an email, please make sure you've entered the address you registered with, and check your spam folder.
vi: Nếu bạn không nhận được email, hãy kiểm tra hộp thư rác (spam).

source: Password Reset
vi: Đặt lại mật khẩu

source: We have received a request to reset your password. Click the button below to reset your password:
vi: Chúng tôi đã nhận được yêu cầu đặt lại mật khẩu của bạn. Nhấn vào nút bên dưới để đặt lại mật khẩu của bạn:

source: You're receiving this email because you requested a password reset for your user account at %(site_name)s.
vi: Bạn nhận được email này vì bạn đã yêu cầu đặt lại mật khẩu tại %(site_name)s.

source: Please go to the following page and choose a new password:
vi: Đến trang tiếp theo và chọn mật khẩu mới:

source: Your username, in case you've forgotten:
vi: Tên đăng nhập, trong trường hợp bạn quên:

source: Thanks for using our site!
vi: Cảm ơn bạn đã đồng hành!

source: The %(site_name)s team
vi: %(site_name)s team

source: Password reset on %(site_name)s
vi: Đặt lại mật khẩu trên %(site_name)s

source: Continue >
vi: Tiếp tục >

source: Registration is currently closed. Please contact an administrator.
vi: Đăng ký hiện tại đã bị dừng. Hãy liên hệ admin.

source: You have successfully been registered. An email has been sent to the email address you provided to confirm your registration. If you don't see it, kindly check your spam folder as well.
vi: Bạn đã đăng ký thành công. Kiểm tra email để hoàn thành việc xác thực. Nếu bạn không tìm thấy nó, vui lòng kiểm tra thư mục spam của bạn.

source: (again, for confirmation)
vi: (một lần nữa)

source: (select your closest major city)
vi: (chọn thành phố gần nhất)

source: or
vi: hoặc

source: pick from map
vi: chọn từ bản đồ

source: Default language
vi: Ngôn ngữ mặc định

source: Register!
vi: Đăng ký!

source: Enter the 6-digit code generated by your app:
vi: Nhập mã xác thực gồm 6 chữ số từ app bạn chọn

source: If you lost your authentication device, please contact us at %(email)s.
vi: Nếu bạn mất thiết bị xác thực, vui lòng liên hệ chúng tôi tại %(email)s.

source: To protect your account, you must first authenticate before you can disable Two Factor Authentication.
vi: Xác thực hai yếu tố.

source: Scan this code with your authenticator app:
vi: Quét mã này bằng ứng dụng xác thực của bạn:

source: QR code
vi: Mã QR

source: Or enter this code manually:
vi: Hoặc nhập mã này thủ công:

source: Submission Statistics
vi: Thống kê

source: AC Submissions by Language
vi: Thống kê AC theo ngôn ngữ

source: Site
vi: Trang

source: Online
vi: Trực tuyến

source: Uptime
vi: Thời gian hoạt động

source: There are no judges available at this time.
vi: Không có máy chấm nào hoạt động.

source: Runtime Info
vi: Thông tin Runtime

source: Judges
vi: Máy chấm

source: Version Matrix
vi: Phiên bản

source: An internal error occurred while grading, and the %(SITE_NAME)s administrators have been notified.<br> In the meantime, try resubmitting in a few seconds.
vi: Lỗi hệ thống đã xảy ra trong lúc chấm bài và các admin %(SITE_NAME)s đã được thông báo.<br> Hãy thử nộp lại bài sau vài giây.

source: An internal error occurred while grading.
vi: Lỗi hệ thống xảy ra trong quá trình chấm.

source: Error information
vi: Thông tin lỗi

source: Filter by status...
vi: Lọc theo kết quả...

source: Filter by language...
vi: Lọc theo ngôn ngữ...

source: You were disconnected. Refresh to show latest updates.
vi: Bạn bị ngắt kết nối. Hãy làm mới để xem cập nhật mới nhất.

source: Total:
vi: Tổng:

source: Friends
vi: Bạn bè

source: rejudge
vi: chấm lại

source: We are waiting for a suitable judge to process your submission...
vi: Các máy chấm đang bận. Hãy kiên nhẫn chờ đợi một chút...

source: Your submission is being processed...
vi: Đang chấm...

source: Compilation Error
vi: Lỗi biên dịch

source: Compilation Warnings
vi: Cảnh báo khi biên dịch

source: Pretest Execution Results
vi: Kết quả chấm Pretest

source: Execution Results
vi: Kết quả chấm

source: Batch
vi: Nhóm

source: Case
vi: Test

source: Overall:
vi: Tổng cộng:

source: Point:
vi: Điểm:

source: Time:
vi: Thời gian:

source: Memory:
vi: Bộ nhớ:

source: Point
vi: Điểm

source: Test case
vi: Test

source: Answer:
vi: Kết quả:

source: Judge feedback:
vi: Phản hồi từ máy chấm:

source: Passing pretests does not guarantee a full score on system tests.
vi: AC pretest không đồng nghĩa AC cả bài nhé :))

source: Submission aborted!
vi: Đã hủy chấm bài nộp!

source: Resubmit
vi: Nộp lại

source: Source code
vi: Mã nguồn

source: Abort
vi: Hủy chấm

source: Contest submissions of
vi: Các bài nộp của

source: %(time)s
vi: vào %(time)s

source: main tests
vi: test chính thức

source: Edit Ticket Assignees
vi: Chỉnh sửa người được chỉ định

source: Select users to assign to this ticket. Start typing to search.
vi: Chọn người dùng để chỉ định cho báo cáo. Bắt đầu nhập để tìm kiếm.

source: Reopened:
vi: Mở lại:

source: Closed:
vi: Đóng:

source: Use desktop notification
vi: Sử dụng thông báo từ desktop

source: Show my tickets only
vi: Chỉ hiển thị các báo cáo dành cho tôi

source: Filing user
vi: Người báo cáo

source: Assignee
vi: Người định uỷ thác

source: Ticket #%(id)d
vi: Báo cáo #%(id)d

source: History for %(ticket)s
vi: Lịch sử của %(ticket)s

source: No description provided
vi: Không có mô tả

source: No history available for this ticket.
vi: Không có lịch sử cho báo cáo này.

source: Back to ticket
vi: Quay về báo cáo

source: Thanks for opening a ticket!
vi: Cảm ơn bạn đã báo cáo!

source: Please keep in mind that this form is for reporting issues with a blog post, and not for general discussion. If you want to discuss the content, please use the comments section instead.
vi: Lưu ý rằng đây là đơn báo cáo các vấn đề trong đề bài, không phải nơi để hỏi bài hay nộp bài.

source: Please keep in mind that this form is for reporting issues with a problem statement, and not for asking for help. If you require assistance on solving a problem, ask in the comments instead.
vi: Lưu ý rằng đây là đơn báo cáo các vấn đề trong đề bài, không phải nơi để hỏi bài hay nộp bài.

source: Could not update notes
vi: Không thể cập nhật ghi chú

source: Error: Could not update assignees
vi: Lỗi: Không thể cập nhật người chỉ định

source: Could not update assignees
vi: Không thể cập nhật người chỉ định

source: Close ticket
vi: Đóng báo cáo

source: Reopen ticket
vi: Mở lại báo cáo

source: Associated object
vi: Đối tượng liên kết

source: No one is assigned.
vi: Không ai được ủy thác.

source: Assignee notes
vi: Lưu ý cho người ủy thác

source: Nothing here.
vi: Không có gì.

source: View history
vi: Xem lịch sử

source: Top Contributors
vi: Đóng góp

source: posts
vi: bài đăng

source: post likes
vi: lượt thích bài đăng

source: comment likes
vi: lượt thích bình luận

source: Top Rating
vi: Xếp hạng cao nhất

source: Top Score
vi: Điểm cao nhất

source: Date of birth
vi: Ngày sinh

source: Address
vi: Địa chỉ

source: T-Shirt size
vi: Kích cỡ áo

source: Change your password
vi: Đổi mật khẩu

source: Avatar
vi: Ảnh đại diện

source: Background
vi: Hình nền

source: Self-description
vi: Tự giới thiệu

source: Select your closest major city
vi: Chọn thành phố gần nhất

source: Editor theme
vi: Giao diện cho code editor

source: Two Factor Authentication is enabled.
vi: Two Factor Authentication đã được kích hoạt.

source: Disable
vi: Tắt

source: Two Factor Authentication is disabled.
vi: Two Factor Authentication chưa kích hoạt.

source: Enable
vi: Bật

source: Update profile
vi: Cập nhật thông tin

source: Failed to read file.
vi: Không thể đọc tệp.

source: No valid users
vi: Không người dùng nào như vậy

source: Submitting import task...
vi: Đang gửi tác vụ nhập...

source: User File
vi: File người dùng

source: Download Sample
vi: Tải xuống ví dụ

source: Previous Import Results:
vi: Kết quả nhập trước đó:

source: Choose an image
vi: Chọn ảnh

source: Problems Solved
vi: Bài đã giải

source: Rating Rank
vi: Hạng Rating

source: Points Rank
vi: Hạng điểm

source: Admin Notes
vi: Lưu ý của admin

source: You have not shared any information.
vi: Bạn chưa chia sẻ thông tin nào.

source: This user has not shared any information.
vi: Người dùng này chưa chia sẻ thông tin nào.

source: Mon
vi: Thứ 2

source: Tues
vi: Thứ 3

source: Wed
vi: Thứ 4

source: Thurs
vi: Thứ 5

source: Fri
vi: Thứ 6

source: Sat
vi: Thứ 7

source: Sun
vi: CN

source: Less
vi: Ít

source: More
vi: Nhiều

source: Rating History
vi: Các lần thi

source: past year
vi: năm ngoái

source: total submission(s)
vi: bài nộp

source: submissions in the last year
vi: bài nộp trong năm qua

source: Unfollow
vi: Bỏ theo dõi

source: Follow
vi: Theo dõi

source: Message
vi: Nhắn tin

source: Contests written
vi: Số kỳ thi

source: Min. rating
vi: Điểm tối thiểu

source: Max rating
vi: Điểm tối đa

source: Editorials
vi: Lời giải

source: Posts
vi: Bài đăng

source: There is no saved problem.
vi: Không có bài tập nào đã lưu.

source: There is no saved contest.
vi: Không có kỳ thi đã lưu.

source: There is no saved editorial.
vi: Không có lời giải nào đã lưu.

source: There is no saved post.
vi: Không có bài đăng nào đã lưu.

source: Import
vi: Thêm

source: Points Breakdown
vi: Phân tích điểm

source: Load more...
vi: Tải thêm...

source: This user has not yet solved any problems.
vi: Người dùng này chưa giải bài nào.

source: Authored Problems
vi: Các bài tập đã ra

source: Hide problems I've solved
vi: Ẩn các bài đã giải

source: %(points).1f points
vi: %(points).1f điểm

source: Impersonate
vi: Giả danh

source: Admin User
vi: Người dùng

source: Admin Profile
vi: Thông tin

source: Upload New File
vi: Tải file lên

source: Storage:
vi: Lưu trữ:

source: Download
vi: Tải xuống

source: You haven't uploaded any files yet.
vi: Bạn chưa tham gia nhóm nào.

source: Upload Your First File
vi: Tải file khác lên

source: Upload
vi: Tải lên

source: Failed to copy URL
vi: Không thể sao chép URL

source: Enter new filename:
vi: tên file input

source: Rename failed
vi: Đổi tên thất bại

source: Storage Usage
vi: Dung lượng sử dụng

source: Files:
vi: Tệp:

source: Upload Files
vi: Tải file lên

source: Max:
vi: Tối đa:

source: per file,
vi: mỗi tệp,

source: files total
vi: tệp tổng cộng

source: Search files...
vi: Tìm files...

source: Sort by:
vi: Sắp xếp theo

source: Name (A-Z)
vi: Tên (A-Z)

source: Name (Z-A)
vi: Tên (Z-A)

source: Date (Newest)
vi: Mới nhất

source: Date (Oldest)
vi: Ngày (Cũ nhất)

source: Size (Largest)
vi: Kích thước (Lớn nhất)

source: Size (Smallest)
vi: Kích thước (Nhỏ nhất)

source: Copy URL
vi: Sao chép URL

source: Rename
vi: tên

source: Change image
vi: Thay đổi ảnh

source: Check all
vi: Chọn tất cả
