Repository: LQDJudge/online-judge
Catalog: locale/*/LC_MESSAGES/djangojs.po
Languages: vi

# time format with day
source: %d day %h:%m:%s
vi: %d ngày %h:%m:%s

source: Failed to get upload configuration
vi: Không thể lấy cấu hình tải lên

source: Upload failed:
vi: Tải lên thất bại:

source: Network error during upload
vi: Lỗi mạng khi tải lên

source: Upload timed out
vi: Hết thời gian tải lên

source: Failed to save file to model
vi: Không thể lưu file

source: Choose a file
vi: Chọn file

source: Change
vi: Thay đổi

source: Remove
vi: Xóa

source: Uploaded image
vi: Ảnh đã tải lên

source: File too large (max
vi: File quá lớn (tối đa

source: Invalid file type
vi: Loại file không hợp lệ

source: Uploaded successfully
vi: Tải lên thành công

source: Cannot delete: missing configuration
vi: Không thể xóa: thiếu cấu hình

source: Are you sure you want to delete this file?
vi: Bạn có chắc chắn muốn xóa file này không?

source: Failed to delete file
vi: Không thể xóa file

source: File deleted
vi: Đã xóa file

source: Enter your text here...
vi: Nhập nội dung tại đây...

source: Collapse
vi: Thu gọn

source: Add Choice
vi: Thêm lựa chọn

source: Choice ID (e.g., A, B, C)
vi: ID lựa chọn (vd: A, B, C)

source: Choice text
vi: Nội dung lựa chọn

source: Expand with toolbar
vi: Mở rộng với thanh công cụ
