Repository: LQDJudge/online-judge
Catalog: locale/*/LC_MESSAGES/django.po
Languages: vi

source: Remove Quiz from Lesson
vi: Xóa bài kiểm tra khỏi bài học

source: Quiz removed from lesson.
vi: Đã xóa bài kiểm tra khỏi bài học.

source: Quiz not found.
vi: Không tìm thấy bài kiểm tra.

source: Contest has not started yet.
vi: Kỳ thi chưa bắt đầu.

source: Contest has ended.
vi: Kỳ thi đã kết thúc.

source: Your contest time has ended.
vi: Thời gian thi của bạn đã hết.

source: You have reached the maximum number of attempts (%d) for this quiz.
vi: Bạn đã đạt số lần làm bài tối đa (%d) cho bài kiểm tra này.

source: You cannot attempt this quiz.
vi: Bạn không thể làm bài kiểm tra này.

source: Taking: %s
vi: Đang làm: %s

source: This is not your attempt.
vi: Đây không phải lượt làm bài của bạn.

source: Time has expired. Your quiz has been submitted automatically.
vi: Đã hết thời gian. Bài kiểm tra của bạn đã được nộp tự động.

source: Contest has ended. Your quiz has been submitted automatically.
vi: Kỳ thi đã kết thúc. Bài kiểm tra của bạn đã được nộp tự động.

source: Your contest time has ended. Your quiz has been submitted automatically.
vi: Thời gian thi của bạn đã hết. Bài kiểm tra của bạn đã được nộp tự động.

source: Warning: You may have this quiz open in another tab. Only one tab should be active.
vi: Cảnh báo: Có thể bạn đang mở bài kiểm tra này ở tab khác. Chỉ nên sử dụng một tab.

source: This attempt was already submitted.
vi: Lượt làm bài này đã được nộp.

source: Time had expired. Your answers were saved and the quiz has been submitted.
vi: Đã hết thời gian. Câu trả lời của bạn đã được lưu và bài kiểm tra đã được nộp.

source: Quiz submitted successfully!
vi: Đã nộp bài kiểm tra thành công!

source: Results: %s
vi: Kết quả: %s

source: You cannot view this result.
vi: Bạn không thể xem kết quả này.

source: Attempts by %(user)s: %(quiz)s
vi: Các lượt làm bài của %(user)s: %(quiz)s

source: My Attempts: %s
vi: Các lượt làm bài của tôi: %s

source: Grading Dashboard
vi: Bảng điều khiển chấm bài

source: Grade Attempt
vi: Chấm lượt làm bài

source: You cannot grade this quiz.
vi: Bạn không thể chấm bài kiểm tra này.

source: Grading saved successfully.
vi: Đã lưu chấm điểm thành công.

source: Statistics: %s
vi: Thống kê: %s

source: You cannot export this quiz's grades.
vi: Bạn không có quyền xuất điểm của bài kiểm tra này.

source: Question Analysis: %s
vi: Phân tích câu hỏi: %s

source: Best solutions for %s
vi: Các bài nộp tốt nhất cho %s

source: Best solutions for %(problem)s in %(contest)s
vi: Các bài nộp tốt nhất cho %(problem)s trong %(contest)s

source: Best solutions for problem %(number)s in %(contest)s
vi: Các bài nộp tốt nhất cho bài %(number)s trong %(contest)s

source: Username
vi: Tên đăng nhập

source: Preferred language
vi: Ngôn ngữ ưa thích

source: The email address "%s" is already taken. Only one registration is allowed per address.
vi: Email "%s" đã được sử dụng. Mỗi email chỉ có thể đăng ký một tài khoản.

source: Registration
vi: Đăng ký

source: Authentication failure
vi: Xác thực thất bại

source: Resolver
vi: Trình giải quyết

source: Language statistics
vi: Thống kê ngôn ngữ

source: Submissions
vi: Bài nộp

source: Comments
vi: Bình luận

source: Chat messages
vi: Tin nhắn

source: Site statistics
vi: Thống kê

source: Status
vi: Kết quả chấm

source: Version matrix
vi: Ma trận phiên bản

source: Submission of %(problem)s by %(user)s
vi: Bài nộp của %(user)s cho bài %(problem)s

source: All submissions
vi: Tất cả bài nộp

source: All my submissions
vi: Tất cả bài nộp của tôi

source: All submissions by %s
vi: Tất cả bài nộp của %s

source: All submissions by <a href="{1}">{0}</a>
vi: Tất cả bài nộp của <a href="{1}">{0}</a>

source: All friend submissions
vi: Bài nộp của bạn bè

source: All submissions for %s
vi: Tất cả bài nộp cho %s

source: Must pass a problem
vi: Phải làm được một bài

source: My submissions for %(problem)s
vi: Bài nộp của tôi cho %(problem)s

source: %(user)s's submissions for %(problem)s
vi: Các bài nộp của %(user)s cho %(problem)s

source: Must pass a contest
vi: Phải qua một kỳ thi

source: Submissions in <a href="{0}">{1}</a>
vi: Bài nộp trong <a href="{0}">{1}</a>

source: <a href="{1}">{0}</a>'s submissions for <a href="{3}">{2}</a> in <a href="{5}">{4}</a>
vi: Các bài nộp của <a href="{1}">{0}</a> cho <a href="{3}">{2}</a> trong <a href="{5}">{4}</a>

source: <a href="{1}">{0}</a>'s submissions for problem {2} in <a href="{4}">{3}</a>
vi: Các bài nộp của <a href="{1}">{0}</a> cho bài {2} trong <a href="{4}">{3}</a>

source: You don't have permission to access.
vi: Bạn không có quyền truy cập.

source: Ticket title
vi: Tiêu đề báo cáo

source: New ticket for %s
vi: Báo cáo mới cho %s

source: %(title)s - Ticket %(id)d
vi: %(title)s - Báo cáo %(id)d

source: Search for users to assign...
vi: Tìm kiếm người dùng...

source: Assignees
vi: Người được ủy thác

source: You don't have permission to edit assignees for this ticket.
vi: Bạn không có quyền trong báo cáo này.

source: Invalid form data
vi: Nội dung không hợp lệ.

source: Tickets - Page %(number)d of %(total)d
vi: Báo cáo - Trang %(number)d trên %(total)d

source: New Ticket: %s
vi: Báo cáo mới: %s

source: #%(id)d, assigned to: %(users)s
vi: #%(id)d, được phân cho: %(users)s

source: no one
vi: không người nào

source: New Ticket Message For: %s
vi: Tin nhắn báo cáo mới cho: %s

source: Tickets for %s
vi: Báo cáo cho %s

source: History for Ticket #%(id)d: %(title)s
vi: Lịch sử báo cáo của #%(id)d: %(title)s

source: Ticket feed
vi: Báo cáo

source: Enable Two Factor Authentication
vi: Kích hoạt Two Factor Authentication

source: Disable Two Factor Authentication
vi: Hủy kích hoạt Two Factor Authentication

source: Perform Two Factor Authentication
vi: Thực hiện Two Factor Authentication

source: No such user
vi: Không người dùng nào như vậy

source: No user handle "%s".
vi: Không tồn tại tên người dùng "%s".

source: My account
vi: Tài khoản của tôi

source: User %s
vi: Thành viên %s

source: M j, Y, G:i
vi: j M, Y, G:i

source: Updated on site
vi: Được cập nhật trên web

source: Edit profile
vi: Chỉnh sửa thông tin

source: Leaderboard
vi: Xếp hạng

source: Import Users
vi: Nhập người dùng

source: Importing users...
vi: Đang nhập người dùng...

source: Invalid upstream data: %s
vi: Dữ liệu không hợp lệ: %s

source: Bad latitude or longitude
vi: Kinh độ / Vĩ độ không hợp lệ

source: Like
vi: Thích

source: Comment
vi: Bình luận

source: Bookmark
vi: Lưu

source: Share
vi: Chia sẻ

source: Report
vi: Báo cáo

source: Copied link
vi: Đã sao chép link

source: Loading comments...
vi: Tải bình luận...

source: Failed to load comments
vi: Tải bình luận thất bại

source: Are you sure you want to rejudge ALL the submissions?
vi: Bạn có muốn chấm lại tất cả bài nộp?

source: Rate all ratable contests
vi: Rate tất cả kỳ thi xếp hạng

source: Disconnect
vi: Ngắt kết nối

source: Terminate
vi: Dừng

source: Edit user
vi: Chỉnh sửa thông tin

source: Rejudge
vi: Chấm lại

source: Notification
vi: Thông báo

source: Dark Mode
vi: Chế độ tối

source: Profile
vi: Trang cá nhân

source: Internal
vi: Nội bộ

source: Stats
vi: Thống kê

source: Bookmarks
vi: Đã lưu

source: Stop impersonating
vi: Ngừng giả danh

source: Log out
vi: Đăng xuất

source: Log in
vi: Đăng nhập

source: Sign up
vi: Đăng ký

source: spectating
vi: đang theo dõi

source: In contest
vi: Trong kỳ thi

source: Out contest
vi: Ngoài kỳ thi

source: This site works best with JavaScript enabled.
vi: Trang web này hoạt động tốt nhất khi bật JavaScript.

source: Tickets
vi: Báo cáo

source: ...More
vi: ...Xem thêm

source: on %(time)s
vi: vào %(time)s

source: News
vi: Tin tức

source: Events
vi: Sự kiện

source: OFFICIAL
vi: CHÍNH THỨC

source: GROUP
vi: NHÓM

source: COMMUNITY
vi: CỘNG ĐỒNG

source: Order by
vi: Sắp xếp theo

source: Newest
vi: Mới nhất

source: Latest Comment
vi: Bình luận mới

source: My Tickets
vi: Của tôi

source: All Tickets
vi: Tất cả

source: All
vi: Tất cả

source: Open
vi: Mở

source: Closed
vi: Đóng

source: No tickets found
vi: Không có báo cáo nào

source: All Comments
vi: Tất cả

source: My Comments
vi: Của tôi

source: Blogs
vi: Bài đăng

source: Other
vi: Thành viên khác

source: No comments found
vi: không có bình luận

source: Clarifications
vi: Thông báo

source: Add
vi: Thêm mới

source: No clarifications have been made at this time.
vi: Không có thông báo nào.

source: Chat Box
vi: Khung chat

source: Search by handle...
vi: Tìm kiếm theo tên...

source: Enter your message
vi: Nhập tin nhắn

source: Emoji
vi: Biểu cảm

source: New message(s)
vi: Tin nhắn mới

source: Mute this user and delete all messages?
vi: Mute người dùng này và xóa tất cả tin nhắn chung?

source: Delete
vi: Xóa

source: You are connect now. Say something to start the conversation.
vi: Các bạn đã kết nối. Nhắn gì đó để bắt đầu cuộc trò chuyện.

source: Lobby
vi: Sảnh chung

source: Ignore
vi: Tắt thông báo

source: Last online on {time}
vi: Trực tuyến vào {time}

source: Unignore
vi: Mở lại thông báo

source: users are online
vi: người đang trực tuyến

source: edit %(edits)s
vi: chỉnh sửa %(edits)s

source: edited
vi: đã chỉnh sửa

source: This comment is hidden due to too much negative feedback. Click <a href="javascript:comment_show_content(%(id)s)">here</a> to view it.
vi: Bình luận bị ẩn vì nhiều phản hồi tiêu cực. Nhấp vào <a href="javascript:comment_show_content(%(id)s)">đây</a> để mở.

source: Please login to vote
vi: Đăng nhập để vote

source: Reply
vi: Phản hồi

source: Hide
vi: Ẩn

source: reply
vi: phản hồi

source: more comment
vi: bình luận nữa

source: Save
vi: Lưu

source: Cancel
vi: Hủy

source: Most recent
vi: Gần nhất

source: Least recent
vi: Xa nhất

source: No comments yet.
vi: Chưa có bình luận nào.

source: Load more comments
vi: Tải thêm bình luận

source: View all comments
vi: Xem tất cả bình luận

source: Solve a problem to comment
vi: Giải một bài để bình luận

source: Write a comment...
vi: Thêm bình luận

source: Post
vi: Đăng

source: Posting...
vi: Đang đăng...

source: Error posting comment
vi: Lỗi khi đăng bình luận

source: Write a reply...
vi: Viết phản hồi...

source: Are you sure you want to hide this comment?
vi: Bạn có chắc chắn muốn ẩn bình luận này không?

source: Error hiding comment
vi: Lỗi khi ẩn bình luận

source: Saving...
vi: Đang lưu...

source: There are no comments at the moment.
vi: Không có bình luận nào.

source: Comments are disabled on this page.
vi: Bình luận bị tắt trong trang này.

source: Error loading comments.
vi: Tải bình luận bị lỗi.

source: Expand editor
vi: Mở rộng trình soạn thảo

source: Collapse editor
vi: Thu gọn trình soạn thảo

source: edit {edits}
vi: chỉnh sửa {edits}

source: Edit your comment...
vi: Chỉnh sửa bình luận

source: An error occurred while saving your comment.
vi: Đã xảy ra lỗi khi lưu bình luận của bạn.

source: Invalid access code.
vi: Mật khẩu truy cập không hợp lệ.

source: Please enter your access code:
vi: Nhập mật khẩu truy cập:

source: Join Contest
vi: Tham gia kỳ thi

source: Prev
vi: Trước

source: Today
vi: Hôm nay

source: Next
vi: Tiếp

source: Sunday
vi: Chủ nhật

source: Monday
vi: Thứ hai

source: Tuesday
vi: Thứ ba

source: Wednesday
vi: Thứ tư

source: Thursday
vi: Thứ năm

source: Friday
vi: Thứ sáu

source: Saturday
vi: Thứ bảy

source: Create
vi: Tạo mới

source: Enter a new key for the cloned contest:
vi: Nhập mã kỳ thi cho kỳ thi nhân bản:

source: Choose target type:
vi: Chọn loại mục tiêu

source: Select a group:
vi: Chọn nhóm:

source: Select a course:
vi: Chọn khóa học:

source: Clone!
vi: Nhân bản!

source: Spectating, contest ends in %(countdown)s.
vi: Đang theo dõi, kỳ thi còn %(countdown)s.

source: Participating virtually, %(countdown)s remaining.
vi: Đang tham gia ảo, còn %(countdown)s.

source: Participating virtually.
vi: Đang tham gia ảo.

source: Starting in %(countdown)s.
vi: Kỳ thi bắt đầu trong %(countdown)s nữa.

source: Contest is over.
vi: Kỳ thi đã kết thúc.

source: Your time is up! Contest ends in %(countdown)s.
vi: Hết giờ! Kỳ thi kết thúc trong %(countdown)s.

source: You have %(countdown)s remaining.
vi: Bạn còn %(countdown)s.

source: Contest ends in %(countdown)s.
vi: Kỳ thi kết thúc trong %(countdown)s

source: F j, Y, G:i T
vi: G:i T, j F, Y

source: %(time_limit)s window between %(start_time)s and %(end_time)s
vi: Dài %(time_limit)s từ %(start_time)s đến %(end_time)s

source: %(length)s long starting on %(start_time)s
vi: Dài %(length)s bắt đầu từ %(start_time)s

source: Standing was frozen
vi: Bảng điểm đã đóng băng

source: at
vi: lúc

source: Official
vi: Chính thức

source: Calendar
vi: Lịch

source: Info
vi: Thông tin

source: Statistics
vi: Thống kê

source: Rankings
vi: Bảng xếp hạng

source: Final rankings
vi: BXH chung cuộc

source: Clone
vi: Nhân bản

source: Leave contest
vi: Rời kỳ thi

source: Virtual join
vi: Tham gia ảo

source: Stop spectating
vi: Ngừng theo dõi

source: Spectate contest
vi: Theo dõi kỳ thi

source: Join contest
vi: Tham gia kỳ thi

source: Login to participate
vi: Đăng nhập để tham gia

source: AC Rate
vi: Tỷ lệ AC

source: Users
vi: Người nộp

source: Editorial
vi: Hướng dẫn

source: Complete problemset
vi: Bộ đề bài

source: View as PDF
vi: Xem PDF

source: Time Limit
vi: Thời gian:

source: Attempts
vi: Số lượt

source: min
vi: phút

source: No limit
vi: Không giới hạn

source: Unlimited
vi: Không giới hạn

source: Name
vi: Tên

source: Are you sure you want to join?
vi: Bạn có chắc tham gia?

source: Joining a contest for the first time starts your timer, after which it becomes unstoppable.
vi: Tham gia kỳ thi lần đầu sẽ kích hoạt thời gian đếm ngược, không thể dừng lại sau đó.

source: By joining in this contest, you will automatically leave contest
vi: Khi tham gia kỳ thi này, bạn sẽ tự động rời khỏi kỳ thi

source: Spectate
vi: Theo dõi

source: Join
vi: Tham gia

source: Active
vi: Đang tham gia

source: Ongoing
vi: Đang diễn ra

source: Upcoming
vi: Sắp diễn ra

source: Past
vi: Đã diễn ra

source: Window ends in %(countdown)s
vi: Cửa số thi còn %(countdown)s

source: Ends in %(countdown)s
vi: Kết thúc trong %(countdown)s

source: There is no active contest at this time.
vi: Không có kỳ thi nào đang tham gia.

source: There is no ongoing contest at this time.
vi: Không có kỳ thi nào đang diễn ra hiện tại.

source: There is no scheduled contest at this time.
vi: Không có kỳ thi nào được lên lịch hiện tại.

source: There is no past contest.
vi: Không có kỳ thi nào trong quá khứ.

source: hidden
vi: ẩn

source: private
vi: riêng tư

source: Start
vi: Bắt đầu

source: End
vi: Kết thúc

source: Length
vi: Dài

source: Category
vi: Loại

source: Location
vi: Địa điểm

source: Year
vi: Năm

source: Are you sure you want to leave?
vi: Bạn có chắc muốn rời?

source: You cannot come back to a virtual participation. You will have to start a new one.
vi: Bạn không thể quay lại lần tham gia ảo này. Bạn sẽ phải tham gia ảo lại từ đầu.

source: Joining a contest starts your timer, after which it becomes unstoppable.
vi: Tham gia kỳ thi sẽ khởi động đồng hồ đếm ngược, và không thể dừng lại.

source: Are you sure you want MOSS the contest?
vi: Bạn có chắc muốn MOSS kỳ thi này?

source: Are you sure you want to delete the MOSS results?
vi: Bạn có chắc muốn xóa kết quả MOSS?

source: No submissions
vi: Không có bài nộp

source: Re-MOSS contest
vi: MOSS lại kỳ thi

source: Delete MOSS results
vi: Xóa kết quả MOSS

source: Contest search
vi: Tìm kiếm kỳ thi

source: Search contests...
vi: Tìm kiếm kỳ thi...

source: From
vi: Từ

source: To
vi: Đến

source: Go
vi: Lọc

source: This contest is private to specific users.
vi: Kỳ thi riêng tư với các thành viên này.

source: Additionally, only the following organizations may access this contest:
vi: Thêm vào đó, chỉ những nhóm này mới được tham gia kỳ thi:

source: Only the following organizations may access this contest:
vi: Chỉ những nhóm sau được tham gia kỳ thi:

source: Problemset
vi: Bộ đề bài

source: Back to Contest
vi: Trở lại kỳ thi

source: Memory Limit
vi: Giới hạn bộ nhớ

source: Points:
vi: Điểm:

source: Time limit:
vi: Thời gian:

source: Memory limit:
vi: Bộ nhớ:

source: stdin
vi: bàn phím

source: stdout
vi: màn hình

source: Un-Disqualify
vi: Khôi phục kết quả

source: Disqualify
vi: Hủy kết quả

source: Fullname
vi: Tên đầy đủ

source: School
vi: Trường

source: Are you sure you want to disqualify this participation?
vi: Bạn có chắc muốn hủy kết quả này?

source: Are you sure you want to un-disqualify this participation?
vi: Bạn có chắc muốn khôi phục kết quả này?

source: Schools
vi: Trường

source: Full name
vi: Họ tên

source: Friends only
vi: Chỉ bạn bè

source: Score only
vi: Chỉ điểm

source: Virtual
vi: Ảo

source: Search...
vi: Tìm kiếm...

source: Hide organization contests
vi: Ẩn các kỳ thi riêng tư của nhóm

source: Show only rated contests
vi: Chỉ hiển thị kỳ thi được xếp hạng

source: Problem Status Distribution
vi: Phân bố theo kết quả

source: Problem AC Rate
vi: Tỷ lệ AC

source: Problem Point Distribution
vi: Phân bố điểm

source: Submissions by Language
vi: Số bài nộp theo ngôn ngữ

source: Language AC Rate
vi: Tỷ lệ AC theo ngôn ngữ

source: Ongoing contests
vi: Kỳ thi đang diễn ra

source: Ends in
vi: Còn

source: Upcoming contests
vi: Kỳ thi sắp diễn ra

source: Create new contest
vi: Tạo kỳ thi mới

source: Enter a new title for the cloned lesson:
vi: Nhập tiêu đề mới cho bài học được nhân bản:

source: Select target course:
vi: Chọn khóa học:

source: No contests available
vi: Không có kì thi nào!

source: Are you sure you want to leave this course?
vi: Bạn có chắc chắn muốn rời khỏi khóa học này?

source: Leave Course
vi: Rời khóa học

source: Lessons
vi: Bài học

source: Total achieved points
vi: Tổng điểm

source: Please fix below errors
vi: Vui lòng sửa các lỗi bên dưới

source: Create Course
vi: Tạo khóa học

source: Create new lesson
vi: Tạo bài học mới

source: If you run out of rows, click Save
vi: Ấn nút lưu lại nếu cần thêm hàng

source: No lessons available
vi: Không có kì thi nào!

source: Are you sure you want to delete this lesson?
vi: Bạn có chắc muốn xóa bài học này?

source: Delete Lesson
vi: Xóa bài học

source: Enrollment Required
vi: Yêu cầu đăng ký

source: You need to enroll in this course to access its content.
vi: Bạn cần đăng ký khóa học này để truy cập nội dung.

source: This course is open for enrollment. Click the button below to join.
vi: Khóa học này đang mở đăng ký. Nhấp vào nút bên dưới để tham gia.

source: Join Course
vi: Tham gia khóa học

source: This course is not open for public enrollment. Please contact the course instructor for access.
vi: Khóa học này không mở đăng ký. Vui lòng liên hệ giảng viên để được cấp quyền truy cập.

source: Please log in to enroll in this course.
vi: Vui lòng đăng nhập để đăng ký khóa học này.

source: About This Course
vi: Về khóa học này

source: Sort by
vi: Sắp xếp theo

source: Search
vi: Tìm kiếm

source: Total
vi: Tổng điểm

source: Edit lessons
vi: Chỉnh sửa bài học

source: Grades
vi: Điểm

source: Members
vi: Thành viên

source: No courses enrolled
vi: Chưa đăng ký khóa học nào

source: You are not enrolled in any courses yet. Browse available courses and join to start learning!
vi: Chào mừng bạn đến với khóa học! Hãy bắt đầu học tập!

source: No courses available to join
vi: Không có khóa học nào để tham gia

source: There are no open courses available for you to join at this time.
vi: Hiện tại không có khóa học mở nào để bạn tham gia.

source: My Courses
vi: Khóa học của tôi

source: Join Courses
vi: Tham gia khóa học

source: Available Courses
vi: Khóa học có sẵn

source: Are you sure you want to remove this member?
vi: Bạn có chắc muốn xóa thành viên này?

source: Are you sure you want to change role of this user?
vi: Bạn có chắc muốn thay đổi vai trò người dùng này?

source: Actions
vi: Hành động

source: No members found
vi: không có thành viên nào!

source: Add New Member
vi: Thêm thành viên

source: Search courses...
vi: Tìm kiếm khóa học...

source: Filter by role:
vi: Lọc theo vai trò:

source: All roles
vi: Tất cả vai trò

source: Teaching + Assistant
vi: Giảng dạy + Trợ giảng

source: Your file has been uploaded successfully
vi: File đã được tải lên thành công

source: Upload another file
vi: Tải file khác lên

source: Upload file
vi: Tải file lên

source: Verify Email
vi: Xác thực Email

source: Invalid reset link.
vi: Đường dẫn không hợp lệ

source: An email was sent to
vi: Email đã được gửi đến

source: If you don't see it, kindly check your spam folder as well.
vi: Nếu bạn không tìm thấy nó, vui lòng kiểm tra thư mục spam của bạn.

source: Your email was sucessfully changed to
vi: Bạn đã đổi email thành công.

source: View more
vi: Xem thêm

source: Drop files here to upload
vi: Kéo file vào đây để tải lên

source: Retry
vi: Thử lại

source: Pause
vi: Dừng

source: Continue
vi: Tiếp tục

source: Dear
vi: Xin chào

source: Problem Queue
vi: Hàng đợi bài tập

source: Average speed
vi: Tốc độ trung bình

source: Slow requests
vi: Requests chậm

source: Analyzing...
vi: Đang phân tích...

source: Problem tagging failed: Problem format is incomplete
vi: Gán nhãn bài không thành công: Định dạng bài tập chưa hoàn chỉnh

source: Problem tagging failed:
vi: Gán nhãn bài không thành công:

source: Problem tagging failed: Network error occurred - please try again later
vi: Gán nhãn bài không thành công: Đã xảy ra lỗi mạng - vui lòng thử lại sau

source: Suggestion Tag
vi: Đề xuất nhãn bài

source: AI Suggested:
vi: Đề xuất:

source: Select problem types...
vi: Tìm kiếm dạng bài...

source: Applying...
vi: Đang lưu...

source: Problem search
vi: Tìm kiếm bài tập

source: Search problems...
vi: Tìm bài tập...

source: Author
vi: Tác giả

source: Point range
vi: Mốc điểm

source: Clear
vi: Xóa

source: Mark private
vi: Đánh dấu riêng tư

source: Problem Tag
vi: Gán nhãn bài

source: AI Analysis Results
vi: Kết quả phân tính

source: Review and modify the AI suggestions before applying them to the problem.
vi: Xem xét và sửa đổi các đề xuất trước khi lưu.

source: Problem Types
vi: Dạng bài tập

source: Apply Changes
vi: Lưu thay đổi

source: Dear authors of
vi: Gửi tác giả của

source: There has been an error with your problem data configuration.
vi: Hiện đang có lỗi với bộ dữ liệu của bài tập của bạn

source: Problem Code
vi: Mã bài tập

source: Problem Name
vi: Tên bài tập

source: Error Type
vi: Lỗi

source: Related Submission
vi: Bài nộp liên quan

source: View Submission
vi: Xem Bài Nộp

source: Error Message
vi: Thông báo lỗi

source: Edit Problem Data
vi: Chỉnh sửa dữ liệu bài tập

source: View Problem
vi: Xem bài tập

source: This is an automated notification from
vi: Đây là thông báo tự động từ

source: If you have any questions, please contact the system administrator.
vi: Nếu bạn có bất kỳ câu hỏi nào, vui lòng liên hệ với quản trị viên.

source: Source:
vi: Nguồn:

source: Read
vi: Đã đọc

source: Error occurred while marking as read
vi: Đã xảy ra lỗi khi đánh dấu là đã đọc

source: All Categories
vi: Tất cả danh mục

source: Unread
vi: Chưa đọc

source: Search in content
vi: Tìm kiếm trong nội dung

source: Filter
vi: Lọc

source: Mark All as Read
vi: Đánh dấu tất cả là đã đọc

source: No notifications found
vi: Không tìm thấy thông báo nào

source: Try adjusting your filters to see more notifications.
vi: Thử điều chỉnh bộ lọc để xem thêm thông báo.

source: You have no notifications yet.
vi: Bạn chưa có thông báo nào.

source: System
vi: Hệ thống

source: Search user
vi: Tìm kiếm người dùng

source: Delete Post
vi: Xóa bài đăng

source: Note (optional):
vi: Ghi chú (tùy chọn):

source: Add a note explaining your decision...
vi: Thêm ghi chú giải thích quyết định của bạn...

source: Confirm
vi: Xác nhận

source: Are you sure you want to delete this post?
vi: Bạn có chắc muốn xóa bài đăng này?

source: Pending
vi: Đang chờ

source: Rejected
vi: Từ chối
