Repository: LQDJudge/online-judge
Catalog: locale/*/LC_MESSAGES/django.po
Languages: vi

source: No rejected posts.
vi: Không có bài đăng bị từ chối.

source: No pending posts.
vi: Không có bài đăng đang chờ duyệt.

source: by
vi: bởi

source: LLM
vi: AI

source: Unknown
vi: Không rõ

source: Approve
vi: Chấp thuận

source: Reject
vi: Từ chối

source: Instruction
vi: Hướng dẫn

source: Config
vi: Cấu hình

source: Hide Config
vi: Ẩn cấu hình

source: Add Course to
vi: Thêm khóa học vào

source: Are you sure you want to delete this course? This action cannot be undone.
vi: Bạn có chắc chắn muốn xóa khóa học này? Hành động này không thể hoàn tác.

source: Edit Course:
vi: Chỉnh sửa khóa học:

source: Course Information
vi: Thông tin khóa học

source: Created:
vi: Được tạo:

source: Students Enrolled:
vi: Học viên đã đăng ký:

source: Lessons:
vi: Bài học:

source: Contests:
vi: Kỳ thi:

source: Save Changes
vi: Lưu thay đổi

source: Delete Course
vi: Xóa khóa học

source: Quick Actions
vi: Hành động nhanh

source: View Course
vi: Xem khóa học

source: View Lessons
vi: Xem bài học

source: View Contests
vi: Xem kỳ thi

source: Course Management
vi: Quản lý khóa học

source: No courses enrolled in %(org)s
vi: Không có khóa học nào đã đăng ký trong %(org)s

source: No courses available to join in %(org)s
vi: Không có khóa học nào có thể tham gia trong %(org)s

source: There are no open courses available for you to join in this organization at this time.
vi: Hiện tại không có khóa học mở nào để bạn tham gia trong tổ chức này.

source: Courses in %(org)s
vi: Khóa học trong %(org)s

source: Teachers
vi: Giáo viên

source: Open for enrollment
vi: Mở đăng ký

source: Closed for enrollment
vi: Đóng đăng ký

source: View
vi: Xem

source: No courses in this organization yet.
vi: Chưa có khóa học nào trong tổ chức này.

source: Create your first course to get started.
vi: Tạo khóa học đầu tiên của bạn để bắt đầu.

source: Are you sure you want to leave this group?
vi: Bạn có chắc muốn rời nhóm?

source: You will have to rejoin to show up on the group leaderboard.
vi: Bạn phải tham gia lại để được hiển thị trong bảng xếp hạng nhóm.

source: You will have to request membership in order to join again.
vi: Bạn phải đăng ký thành viên để được tham gia lại.

source: Are you sure you want to block this group?
vi: Bạn có chắc muốn chặn nhóm?

source: You will leave this group and have to remove block to rejoin.
vi: Bạn sẽ rời khỏi nhóm và phải bỏ chặn để tham gia lại

source: You will have to remove block to join this group.
vi: Bạn sẽ phải bỏ chặn để tham gia nhóm này.

source: Are you sure you want to unblock this group?
vi: Bạn có chắc muốn bỏ chặn nhóm?

source: Public
vi: Công khai

source: Private
vi: Riêng tư

source: members
vi: thành viên

source: Joined
vi: Đã tham gia

source: Join Group
vi: Tham gia nhóm

source: Request to Join
vi: Yêu cầu tham gia

source: Unblock
vi: Bỏ chặn

source: Login to Join
vi: Đăng nhập để tham gia

source: Communities
vi: Cộng đồng

source: Mine
vi: Tôi

source: Blocked
vi: Nhóm đã chặn

source: Community
vi: Cộng đồng

source: You are an admin of this organization
vi: Bạn là admin của nhóm

source: Request membership
vi: Đăng ký thành viên

source: There are no communities yet.
vi: Chưa có cộng đồng nào.

source: You have not joined any group yet.
vi: Bạn chưa tham gia nhóm nào.

source: There is no public group.
vi: Không có nhóm mở nào

source: There is no private group.
vi: Không có nhóm kín nào

source: There is no blocked group.
vi: Không có nhóm nào bị chặn

source: Moderator
vi: Người kiểm duyệt

source: Action
vi: Hành động

source: Preview
vi: Xem trước

source: Reason
vi: Lý do

source: Unhide
vi: Hiện lại

source: Keep
vi: Giữ lại

source: deleted
vi: đã xóa

source: No moderation actions recorded yet.
vi: Chưa có hành động kiểm duyệt nào.

source: Controls
vi: Quản lý

source: Edit group
vi: Chỉnh sửa nhóm

source: View requests
vi: Đơn đăng ký

source: Add members
vi: Thêm thành viên

source: Add blog
vi: Thêm bài đăng

source: Pending blogs
vi: Bài đăng đang chờ

source: Moderation log
vi: Nhật ký kiểm duyệt

source: Subdomain
vi: Site riêng cho nhóm

source: Leave group
vi: Rời nhóm

source: Block group
vi: Chặn nhóm

source: What do you want to share?
vi: Bạn muốn chia sẻ điều gì?

source: Create Post
vi: Tạo bài viết

source: User:
vi: Thành viên:

source: Organization:
vi: Nhóm:

source: Time:
vi: Thời gian:

source: Reason:
vi: Lý do:

source: State
vi: Trạng thái

source: There are no requests to approve.
vi: Không có đơn đăng ký.

source: Delete?
vi: Xóa?

source: Update
vi: Cập nhật

source: Your reason for joining:
vi: Lý do tham gia:

source: Request
vi: Đăng ký

source: Log
vi: Ghi chép

source: Approved
vi: Chấp thuận

source: Group search
vi: Tìm kiếm nhóm

source: Search groups...
vi: Tìm nhóm...

source: Kick
vi: Đuổi

source: Are you sure you want to kick this user from the organization?
vi: Bạn có chắc muốn đuổi người dùng này?

source: Update Preview
vi: Cập nhật xem trước

source: Insert Image
vi: Chèn hình ảnh

source: From the web
vi: Từ web

source: From your computer
vi: Từ máy tính của bạn

source: Metadata
vi: Dữ liệu

source: Publication Date
vi: Ngày được tạo

source: Curators
vi: Người quản lý

source: Testers
vi: Người kiểm tra

source: Problem Description
vi: Đề bài

source: PDF Description
vi: Đề bài PDF

source: Problem Group
vi: Nhóm bài tập

source: Time Limit (s)
vi: Giới hạn thời gian (giây)

source: Memory Unit
vi: Đơn vị bộ nhớ

source: Allowed Languages
vi: Ngôn ngữ lập trình cho phép

source: Select All
vi: Chọn tất cả

source: Create Problem
vi: Tạo bài tập

source: Enter a new code for the cloned problem:
vi: Nhập mã bài mới cho bài tập được nhân bản:

source: Generator script
vi: Script sinh test

source: Add Generator Script
vi: Thêm script sinh test

source: Edit Generator Script
vi: Chỉnh sửa script sinh test

source: View YAML
vi: Xem YAML

source: Test Data Setup
vi: Cách tạo Test Data

source: View Instructions
vi: Xem hướng dẫn

source: Autofill testcases
vi: Tự động điền test

source: Problem type
vi: Dạng bài

source: Fill testcases
vi: Điền test

source: Batch start positions
vi: Vị trí bắt đầu nhóm

source: Leave empty if not use batch. If you want to divide to three batches [1, 4], [5, 8], [9, 10], enter: 1, 5, 9
vi: Để trống nếu không dùng nhóm. Nếu muốn chia test thành các nhóm [1, 4], [5, 8], [9, 10], nhập: 1, 5, 9

source: Generator Script
vi: Script sinh test

source: Enter generator arguments for test cases. Each line represents arguments for one test case.
vi: Nhập các tham số cho script sinh test. Mỗi dòng đại diện cho tham số của một test.

source: IOI Signature Graders
vi: Trình chấm IOI

source: Handler
vi: File xử lý

source: Header
vi: File định nghĩa

source: Apply!
vi: Lưu!

source: Test Cases
vi: Bộ Test

source: Type
vi: Kiểu

source: Input file
vi: File Input

source: Output file
vi: File Output

source: Generator Args
vi: Tham số sinh test

source: Add new case
vi: Thêm test mới

source: Markdown improved!
vi: Đã cải thiện markdown!

source: Error:
vi: Lỗi:

source: No improvements needed
vi: Không cần cải thiện

source: Network error occurred
vi: Xảy ra lỗi mạng

source: Please enter a problem code first.
vi: Vui lòng nhập tên bài

source: Improving markdown...
vi: Đang cải thiện markdown...

source: Processing... please wait
vi: Đang xử lý... vui lòng chờ

source: Copied!
vi: Đã sao chép!

source: Copy
vi: Sao chép

source: Analyzing problem...
vi: Phân tích bài tập...

source: Problem-tag analysis completed successfully!
vi: Gán nhãn bài thành công!

source: Problem format is incomplete - could not analyze
vi: Định dạng bài toán chưa hoàn chỉnh - không thể phân tích

source: Auto Improve Markdown
vi: Tự động cải thiện Markdown

source: Tip: Upload a PDF below and save first, then use this to convert PDF to markdown. Or use it to reformat existing markdown.
vi: Mẹo: Tải PDF lên bên dưới và lưu trước, sau đó dùng tính năng này để chuyển PDF thành markdown. Hoặc dùng để định dạng lại markdown hiện có.

source: Improved Markdown:
vi: Markdown đã cải thiện:

source: Auto-Generate Types & Points
vi: Tự động gán nhãn dạng bài & điểm

source: Remember to use this editorial <b>only</b> when stuck, and <b>not to copy-paste code from it</b>. Please be respectful to the problem author and editorialist. <br><br> <b>Submitting an official solution before solving the problem yourself is a bannable offence.</b>
vi: Chỉ sử dụng khi thực sự cần thiết như một cách tôn trọng tác giả và người viết hướng dẫn này. <br><br> <b>Chép code từ bài hướng dẫn để nộp bài là hành vi có thể dẫn đến khóa tài khoản.</b>

source: FOR YOU
vi: DÀNH CHO BẠN

source: NEW
vi: MỚI NHẤT

source: Edit Language Limits
vi: Chỉnh sửa giới hạn ngôn ngữ

source: Are you sure you want to delete this language limit?
vi: Bạn có chắc muốn xóa giới hạn ngôn ngữ này?

source: No language-specific limits have been set.
vi: Chưa có giới hạn riêng cho ngôn ngữ nào.

source: Default Limits
vi: Giới hạn mặc định

source: Languages without specific limits will use these default values.
vi: Các ngôn ngữ không có giới hạn riêng sẽ sử dụng giá trị mặc định này.

source: Add Language Limit
vi: Thêm giới hạn ngôn ngữ

source: Edit Language Templates
vi: Chỉnh sửa code mẫu

source: Are you sure you want to delete this language template?
vi: Bạn có chắc muốn xóa code mẫu này?

source: No language templates have been added. Templates provide starter code for specific languages.
vi: Chưa có template nào được thêm. Template cung cấp code mẫu cho từng ngôn ngữ.

source: Add Language Template
vi: Thêm code mẫu

source: Template Source Code
vi: Code mẫu

source: Provide starter code that will be pre-filled when users select this language.
vi: Cung cấp mã nguồn mẫu sẽ được điền sẵn khi người dùng chọn ngôn ngữ này.

source: Feed
vi: Gợi ý

source: List
vi: Danh sách

source: Filter by type...
vi: Lọc theo dạng...

source: Types
vi: Dạng

source: AC #
vi: Số AC

source: Add clarifications
vi: Thêm thông báo

source: Leave empty to not filter by language
vi: Để trống nếu không lọc theo ngôn ngữ

source: Leave empty to not filter by result
vi: Để trống nếu không lọc theo kết quả

source: Leave empty to not filter by contest
vi: Để trống nếu không lọc theo kỳ thi

source: Need valid values for both start and end IDs.
vi: Cần số liệu hợp lệ cho ID bắt đầu và kết thúc.

source: End ID must be after start ID.
vi: ID kết thúc phải lớn hơn hoặc bằng ID khởi đầu.

source: You are about to {action} {count} submissions. Are you sure you want to do this?
vi: Bạn chuẩn bị {action} {count} bài nộp. Tiếp tục?

source: You are about to {action} a few submissions. Are you sure you want to do this?
vi: Bạn chuẩn bị {action} vài bài nộp. Tiếp tục?

source: Filter submissions
vi: Lọc bài nộp

source: Filter by ID:
vi: Lọc theo ID:

source: Starting ID:
vi: ID bắt đầu:

source: Ending ID:
vi: ID kết thúc:

source: This range includes both endpoints.
vi: Bao gồm hai đầu mút.

source: Filter by language:
vi: Lọc theo ngôn ngữ:

source: Filter by result:
vi: Lọc theo kết quả:

source: Filter by contest:
vi: Lọc theo kỳ thi:

source: Rejudge selected submissions
vi: Chấm lại những bài nộp này

source: Download selected submissions
vi: Tải các bài nộp này

source: Are you sure you want to rescore %(count)d submissions?
vi: Bạn có chắc muốn tính điểm lại %(count)d bài nộp?

source: Rescore all submissions
vi: Tính điểm lại các bài nộp

source: Submit
vi: Nộp bài

source: %(counter)s submission left
vi: Còn %(counter)s lần nộp

source: 0 submissions left
vi: Còn 0 lần nộp

source: My submissions
vi: Bài nộp của tôi

source: Best submissions
vi: Các bài nộp tốt nhất

source: Read editorial
vi: Xem hướng dẫn

source: Manage tickets
vi: Xử lý báo cáo

source: My tickets
vi: Báo cáo của tôi

source: Manage submissions
vi: Quản lý bài nộp

source: Clone problem
vi: Nhân bản bài

source: Edit problem
vi: Chỉnh sửa bài

source: Edit test data
vi: Chỉnh sửa test

source: Edit language limits
vi: Chỉnh sửa giới hạn ngôn ngữ

source: Edit templates
vi: Chỉnh sửa code mẫu

source: Edit solutions
vi: Chỉnh sửa lời giải

source: Edit translations
vi: Chỉnh sửa bản dịch

source: Author:
vi: Tác giả:

source: Allowed languages
vi: Ngôn ngữ cho phép

source: No %(lang)s judge online
vi: Không có máy chấm cho %(lang)s

source: Judge
vi: Máy chấm

source: none available
vi: Bài này chưa có máy chấm

source: This problem has %(length)s clarification(s)
vi: Bài này có %(length)s thông báo

source: Request clarification
vi: Yêu cầu làm rõ đề

source: Last unsolved
vi: Nộp gần đây

source: Recommended problems
vi: Bài tập gợi ý

source: Hide solved problems
vi: Ẩn các bài đã giải

source: Show problem types
vi: Hiển thị dạng bài

source: Show editorial
vi: Hiển thị hướng dẫn

source: Problem types
vi: Dạng bài

source: Random
vi: Ngẫu nhiên

source: Solution generated!
vi: Đã tạo lời giải!

source: based on AC code
vi: dựa trên code AC

source: No solution generated
vi: Không tạo được lời giải

source: Generating solution...
vi: Đang tạo lời giải...

source: Inserted into editor!
vi: Đã chèn vào trình soạn thảo!

source: Whether this solution should be publicly visible to all users.
vi: Lời giải này có được hiển thị công khai cho tất cả người dùng hay không.

source: Date and time when this solution should become available.
vi: Ngày và giờ lời giải này sẽ được công bố.

source: Select the authors who contributed to this solution.
vi: Chọn các tác giả đã đóng góp cho lời giải này.

source: Auto Generate Solution
vi: Tự động tạo lời giải

source: Tip: Uses AI to generate a solution based on the problem statement and AC submissions. You can optionally provide your rough ideas.
vi: Mẹo: Sử dụng AI để tạo lời giải dựa trên đề bài và các bài nộp AC. Bạn có thể nhập ý tưởng sơ bộ của mình.

source: Your rough ideas (optional):
vi: Ý tưởng sơ bộ của bạn (tùy chọn):

source: Enter your solution approach, main ideas, or rough draft here. Leave empty to generate from scratch...
vi: Nhập cách tiếp cận, ý tưởng chính hoặc bản nháp của bạn ở đây. Để trống nếu muốn tạo từ đầu...

source: Generate Solution
vi: Tạo lời giải

source: Generated Solution:
vi: Lời giải đã tạo:

source: Insert
vi: Chèn

source: Write the solution explanation, approach, and implementation details.
vi: Viết lời giải, phương pháp tiếp cận và chi tiết cài đặt.

source: Update Solution
vi: Cập nhật lời giải

source: Add Solution
vi: Thêm lời giải

source: Wait
vi: Đợi

source: Your source code must contain at most 65536 characters.
vi: Code phải chứa không quá 65536 ký tự.

source: <b>Warning!</b> Your default language, <b>%(default_language)s</b>, is unavailable for this problem and has been deselected.
vi: <b>Cẩn thận!</b> Ngôn ngữ ưa thích của bạn, <b>%(default_language)s</b>, không được sử dụng trong bài này.

source: You have %(left)s submission left
vi: Bạn còn %(left)s lần nộp

source: You have 0 submissions left
vi: Bạn đã hết lần nộp

source: No judge is available for this problem.
vi: Không có máy chấm có thể chấm bài này.

source: Submit!
vi: Nộp bài!

source: Error: Could not find form for translation
vi: Lỗi: Không tìm thấy form cho bản dịch

source: Error: Form is missing required fields
vi: Lỗi: Form thiếu các phần bắt buộc

source: Edit Translations
vi: Chỉnh sửa bản dịch

source: Are you sure you want to delete this translation?
vi: Bạn có chắc muốn xóa bản dịch này?

source: Problem name translated into the selected language.
vi: Tên bài tập được dịch sang ngôn ngữ đã chọn.

source: Problem description translated into the selected language.
vi: Mô tả bài tập được dịch sang ngôn ngữ đã chọn.

source: No translations have been added.
vi: Chưa có bản dịch nào được thêm.

source: Add Translation
vi: Thêm bản dịch

source: Select the language for this translation.
vi: Chọn ngôn ngữ cho bản dịch này.

source: %(counter)s problem solved
vi: Đã giải %(counter)s bài

source: Total points
vi: Tổng điểm

source: Rank by rating
vi: Rank theo rating

source: Rank by points
vi: Rank theo điểm

source: Awards
vi: Thành tích

source: Attempts by
vi: Lượt làm của

source: My Attempts
vi: Lượt làm của tôi

source: Total Attempts
vi: Tổng số lượt làm

source: Best Score
vi: Điểm cao nhất

source: Submitted
vi: Đã nộp

source: In Progress
vi: Đang làm

source: You have not attempted this quiz yet.
vi: Bạn chưa làm bài kiểm tra này.

source: Start Quiz
vi: Bắt đầu làm bài

source: Quiz attempts of
vi: Lượt làm bài kiểm tra của

source: Best score
vi: Điểm cao nhất

source: No attempts yet.
vi: Chưa có lượt làm bài nào.

source: Type to search questions...
vi: Nhập để tìm câu hỏi...

source: Please select at least one question.
vi: Vui lòng chọn ít nhất một câu hỏi.

source: Drag to reorder
vi: Kéo để sắp xếp lại

source: pts
vi: điểm

source: Remove
vi: Xóa

source: Drag to reorder questions
vi: Kéo để sắp xếp lại câu hỏi

source: No questions added yet. Add questions below.
vi: Chưa có câu hỏi nào. Thêm câu hỏi bên dưới.

source: Add Question
vi: Thêm câu hỏi

source: Select questions to add:
vi: Chọn câu hỏi để thêm:

source: Points per question:
vi: Điểm mỗi câu:

source: Add Selected Questions
vi: Thêm các câu hỏi đã chọn

source: Create new question
vi: Tạo câu hỏi mới

source: Warning: This quiz has %(count)d attempt(s). Deleting will remove all student attempts and scores.
vi: Cảnh báo: Bài kiểm tra này có %(count)d lượt làm bài. Xóa sẽ xóa tất cả các lượt làm bài và điểm của học sinh.

source: Are you sure you want to delete this quiz?
vi: Bạn có chắc chắn muốn xóa bài kiểm tra này?

source: Delete Quiz
vi: Xóa bài kiểm tra

source: Continue Attempt
vi: Tiếp tục làm bài

source: No attempts remaining
vi: Không còn lượt làm bài

source: remaining
vi: còn lại

source: No questions added yet.
vi: Chưa có câu hỏi nào.

source: questions
vi: câu hỏi

source: minutes
vi: phút

source: New
vi: Mới

source: Remove this question from the quiz?
vi: Xóa câu hỏi này khỏi bài kiểm tra?

source: Undo
vi: Hoàn tác

source: Are you sure you want to delete this quiz? This action cannot be undone.
vi: Bạn có chắc chắn muốn xóa bài kiểm tra này? Hành động này không thể hoàn tác.

source: Are you sure you want to regrade all attempts? This will recalculate scores for all submitted attempts.
vi: Bạn có chắc chắn muốn chấm lại tất cả lượt làm bài? Điều này sẽ tính lại điểm cho tất cả các lượt làm bài đã nộp.

source: Regrade All Attempts
vi: Chấm lại tất cả lượt làm bài

source: Quiz Info
vi: Thông tin

source: Total Points
vi: Tổng điểm

source: Edit Quiz
vi: Chỉnh sửa bài kiểm tra

source: Unsaved changes
vi: Thay đổi chưa lưu

source: No questions assigned yet.
vi: Chưa có câu hỏi nào được gán.

source: No answer provided
vi: Không có câu trả lời

source: Attached files
vi: Tệp đính kèm

source: Last graded
vi: Chấm lần cuối

source: Save Grades
vi: Lưu điểm

source: Back to Dashboard
vi: Quay lại bảng điều khiển

source: No essay questions to grade for this attempt.
vi: Không có câu hỏi tự luận cần chấm cho lượt làm bài này.

source: All Quizzes
vi: Tất cả bài kiểm tra

source: Search user...
vi: Tìm kiếm người dùng...

source: All Statuses
vi: Tất cả trạng thái

source: All Users
vi: Tất cả người dùng

source: Needs Grading
vi: Cần chấm

source: Graded
vi: Đã chấm

source: view
vi: xem

source: grade
vi: chấm

source: No attempts to grade
vi: Không có lượt làm bài cần chấm

source: All essay questions have been graded, or no attempts match your filters.
vi: Tất cả câu hỏi tự luận đã được chấm, hoặc không có lượt làm bài nào phù hợp với bộ lọc của bạn.

source: Current Score
vi: Điểm hiện tại

source: Auto-graded
vi: Chấm tự động

source: Correct
vi: Đúng

source: Student Answer
vi: Câu trả lời của học sinh

source: Attached Files
vi: Tệp đính kèm

source: Optional feedback for the student...
vi: Nhận xét cho học sinh (không bắt buộc)...

source: Grade
vi: Chấm điểm

source: Contest Quizzes
vi: Bài kiểm tra trong kỳ thi

source: Quizzes for
vi: Bài kiểm tra cho

source: mins
vi: phút

source: Progress
vi: Tiến độ

source: Best
vi: Tốt nhất

source: No quizzes found
vi: Không tìm thấy bài kiểm tra

source: There are no quizzes in this contest.
vi: Không có bài kiểm tra nào trong kỳ thi này.

source: There are no quizzes available at this time.
vi: Hiện không có bài kiểm tra nào.

source: View Quiz
vi: Xem bài kiểm tra

source: Average Score
vi: Điểm trung bình

source: Highest Score
vi: Điểm cao nhất

source: Title
vi: Tiêu đề

source: Recent Attempts
vi: Các lượt làm bài gần đây

source: Started
vi: Bắt đầu

source: Question Analysis
vi: Phân tích câu hỏi

source: Total Questions
vi: Tổng số câu hỏi

source: Responses
vi: Số lượt trả lời

source: Correct Rate
vi: Tỉ lệ đúng

source: Avg Points
vi: Điểm TB

source: Choice Distribution
vi: Phân bố lựa chọn

source: No questions in this quiz yet.
vi: Chưa có câu hỏi nào trong bài kiểm tra này.

source: Answer Choices
vi: Các lựa chọn đáp án

source: Correct Answers Configuration
vi: Cấu hình đáp án đúng

source: Match Type
vi: Kiểu khớp

source: Exact Match
vi: Khớp chính xác

source: Regular Expression
vi: Biểu thức chính quy

source: Exact: student answer must match one of the answers. Regex: use regular expression patterns.
vi: Khớp chính xác: câu trả lời phải khớp với một trong các đáp án. Regex: sử dụng biểu thức chính quy.

source: Case Sensitive
vi: Phân biệt hoa/thường

source: Accepted Answers
vi: Đáp án được chấp nhận

source: Add Answer
vi: Thêm đáp án

source: Enter an accepted answer...
vi: Nhập đáp án được chấp nhận...

source: Help
vi: Trợ giúp

source: Question Types
vi: Các loại câu hỏi

source: Single correct answer
vi: Một đáp án đúng

source: Multiple correct answers
vi: Nhiều đáp án đúng

source: Binary choice
vi: Lựa chọn đúng/sai

source: Text-based answer
vi: Trả lời bằng văn bản

source: Long-form, manually graded
vi: Câu hỏi dài, chấm thủ công

source: Grading Strategies
vi: Cách tính điểm

source: For Multiple Answer questions:
vi: Với câu hỏi nhiều đáp án:

source: Full points only if all correct answers selected
vi: Được điểm tối đa khi chọn đúng tất cả đáp án

source: Gains points for correct, loses for wrong
vi: Được điểm khi đúng, mất điểm khi sai

source: Correct count minus wrong count
vi: Số đáp án đúng trừ số đáp án sai

source: Correct Only
vi: Chỉ tính đáp án đúng

source: Only gains points for correct selections
vi: Chỉ cộng điểm cho các lựa chọn đúng

source: Warning: This question is used in the following quizzes:
vi: Cảnh báo: Câu hỏi này đang được sử dụng trong các bài kiểm tra sau:

source: You must remove it from these quizzes before deleting.
vi: Bạn phải xóa câu hỏi này khỏi các bài kiểm tra đó trước khi xóa.

source: Are you sure you want to delete this question?
vi: Bạn có chắc muốn xóa câu hỏi này?

source: Delete Question
vi: Xóa câu hỏi

source: Cannot delete: This question is used in one or more quizzes. Remove it from those quizzes first.
vi: Không thể xóa: Câu hỏi này đang được sử dụng trong một hoặc nhiều bài kiểm tra. Hãy xóa câu hỏi khỏi các bài kiểm tra đó trước.

source: Are you sure you want to delete this question? This action cannot be undone.
vi: Bạn có chắc chắn muốn xóa câu hỏi này? Hành động này không thể hoàn tác.

source: Correct Answer(s)
vi: Đáp án đúng

source: Used in Quizzes
vi: Được sử dụng trong các bài kiểm tra

source: Edit Question
vi: Chỉnh sửa câu hỏi

source: Question search
vi: Tìm kiếm câu hỏi

source: Search questions...
vi: Tìm kiếm câu hỏi...

source: Visibility
vi: Hiển thị

source: No questions found
vi: Không tìm thấy câu hỏi nào

source: There are no questions matching your search criteria.
vi: Không có câu hỏi nào phù hợp với tiêu chí tìm kiếm của bạn.

source: Analysis
vi: Phân tích

source: Back to Quiz
vi: Quay về bài kiểm tra

source: Retake Quiz
vi: Làm lại bài kiểm tra

source: Your Answers
vi: Câu trả lời của bạn

source: Pending grading
vi: Đang chờ chấm điểm

source: Your answer
vi: Câu trả lời của bạn

source: Correct answer
vi: Đáp án đúng
