Repository: LQDJudge/online-judge
Catalog: locale/*/LC_MESSAGES/django.po
Languages: vi

source: html link to comments, used for non-comments
vi: liên kết html đến bình luận, dùng cho không phải bình luận

source: who triggered, used for non-comment
vi: ai kích hoạt, dùng cho không phải bình luận

source: is read
vi: đã đọc

source: read at
vi: đọc lúc

source: extra data
vi: dữ liệu bổ sung

source: Additional data for complex notifications
vi: Dữ liệu bổ sung cho thông báo phức tạp

source: notification
vi: thông báo

source: notifications
vi: thông báo

source: The problem is public to:
vi: Bài tập được công khai trong:

source: The problem is private to:
vi: Bài tập riêng tư trong:

source: The problem is public to everyone.
vi: Bài tập được công khai với mọi người.

source: The problem is private.
vi: Bài tập được đánh dấu riêng tư.

source: last read time
vi: thời gian đọc cuối

source: notification profile
vi: hồ sơ thông báo

source: notification profiles
vi: hồ sơ thông báo

source: pagevote
vi: bình chọn

source: pagevotes
vi: bình chọn

source: pagevote vote
vi: vote từ TNV

source: pagevote votes
vi: vote từ TNV

source: problem category ID
vi: mã của nhóm bài

source: problem category name
vi: tên nhóm bài

source: problem type
vi: dạng bài

source: problem types
vi: dạng bài

source: problem group ID
vi: mã của nhóm bài

source: problem group name
vi: tên nhóm bài

source: problem group
vi: nhóm bài

source: problem groups
vi: nhóm bài

source: key
vi: khóa

source: link
vi: đường dẫn

source: full name
vi: tên đầy đủ

source: short name
vi: tên ngắn

source: Displayed on pages under this license
vi: Được hiển thị trên các trang theo giấy phép này

source: URL to the icon
vi: Đường dẫn icon

source: license text
vi: văn bản giấy phép

source: license
vi: giấy phép

source: licenses
vi: giấy phép

source: problem code
vi: mã bài

source: A short, unique code for the problem, used in the url after /problem/
vi: Mã bài ngắn, độc nhất cho bài tập, được dùng trong url sau /problem/

source: problem name
vi: Tên bài

source: The full name of the problem, as shown in the problem list.
vi: Tên đầy đủ của bài, như được hiển thị trên danh sách bài tập

source: problem body
vi: Nội dung

source: creators
vi: người tạo

source: These users will be able to edit the problem, and be listed as authors.
vi: Những người dùng này sẽ có thể chỉnh sửa bài tập, và nằm trong danh sách các tác giả

source: These users will be able to edit the problem, but not be listed as authors.
vi: Những người dùng này sẽ có thể chỉnh sửa bài tập, nhưng không nằm trong danh sách các tác giả

source: These users will be able to view the private problem, but not edit it.
vi: Những người dùng này sẽ thấy được bài tập này (dù riêng tư), nhưng không chỉnh sửa được

source: The type of problem, as shown on the problem's page.
vi: Dạng bài, giống như trên trang bài tập

source: The group of problem, shown under Category in the problem list.
vi: Nhóm bài, hiện ở mục Nhóm bài trong danh sách bài tập

source: The time limit for this problem, in seconds. Fractional seconds (e.g. 1.5) are supported.
vi: Giới hạn thời gian cho bài tập này, theo đơn vị giây. Có thể nhập số thực (ví dụ 1.5)

source: memory limit
vi: Giới hạn bộ nhớ

source: The memory limit for this problem, in kilobytes (e.g. 256mb = 262144 kilobytes).
vi: Giới hạn bộ nhớ cho bài này, theo đơn vị kilobytes (ví dụ 256mb = 262144 kilobytes)

source: stop on first fail
vi: dừng chấm khi có test sai

source: Stop judging when the first test case fails (ICPC-style). If disabled, all test cases will be judged.
vi: Dừng chấm khi test đầu tiên sai (format ICPC). Nếu tắt, tất cả test sẽ được chấm.

source: Points awarded for problem completion. Points are displayed with a 'p' suffix if partial.
vi: Điểm thưởng khi hoàn thành bài tập. Điểm có thêm chữ 'p' ở sau cùng nếu như chấp nhận cho điểm thành phần (có điểm ngay khi không đúng toàn bộ test)

source: allows partial points
vi: cho phép điểm thành phần

source: allowed languages
vi: các ngôn ngữ được cho phép

source: List of allowed submission languages.
vi: Danh sách các ngôn ngữ lập trình cho phép

source: manually managed
vi: quản lý thủ công

source: Whether judges should be allowed to manage data or not.
vi: Máy chấm có được phép quản lý dữ liệu hay không.

source: date of publishing
vi: Ngày công bố

source: Doesn't have magic ability to auto-publish due to backward compatibility
vi: Không có khả năng tự động công khai vì lý do tương thích ngược

source: Bans the selected users from submitting to this problem.
vi: Cấm những người dùng được chọn nộp bài tập này.

source: The license under which this problem is published.
vi: Giấy phép xuất bản bài tập

source: problem summary
vi: Tóm tắt bài tập

source: number of users
vi: số lượng người dùng

source: The number of users who solved the problem.
vi: Số lượng người dùng đã giải được bài

source: solve rate
vi: Tỉ lệ giải đúng

source: If private, only these organizations may see the problem.
vi: Nếu bài riêng tư, chỉ những nhóm này thấy được

source: pdf statement
vi: Đề bài bằng file pdf

source: language
vi: Ngôn ngữ

source: translated name
vi: Tên bài được dịch

source: translated description
vi: Đề bài được dịch

source: problem translation
vi: bản dịch bài tập

source: problem translations
vi: bản dịch bài tập

source: language-specific resource limit
vi: giới hạn tài nguyên theo ngôn ngữ

source: language-specific resource limits
vi: giới hạn tài nguyên theo ngôn ngữ

source: source code
vi: mã nguồn

source: language-specific template
vi: template theo ngôn ngữ

source: language-specific templates
vi: template theo ngôn ngữ

source: associated problem
vi: bài tập liên quan

source: publish date
vi: ngày xuất bản

source: editorial content
vi: nội dung lời giải

source: Editorial for %s
vi: Lời giải cho %s

source: solution
vi: lời giải

source: solutions
vi: lời giải

source: proposed point value
vi: điểm

source: The amount of points you think this problem deserves.
vi: Bạn nghĩ bài này đáng bao nhiêu điểm?

source: The time this vote was cast
vi: Thời gian bỏ phiếu

source: vote
vi: bình chọn

source: Standard
vi: Tiêu chuẩn

source: Floats
vi: Số thực

source: Floats (absolute)
vi: Số thực (chênh lệch tuyệt đối)

source: Floats (relative)
vi: Số thực (chênh lệch tương đối)

source: Non-trailing spaces
vi: Không xét dấu cách cuối dòng

source: Unordered
vi: Không thứ tự

source: Byte identical
vi: Giống từng byte

source: Line-by-line
vi: Chấm theo dòng (điểm = số dòng đúng)

source: Custom checker (PY)
vi: Trình chấm tự viết (Python)

source: Custom checker (CPP)
vi: Trình chấm tự viết (CPP)

source: Interactive
vi: Tương tác

source: Interactive (Testlib)
vi: trình chấm interactive

source: data zip file
vi: file zip chứa test

source: generator file
vi: file sinh test

source: generator script
vi: script sinh test

source: output prefix length
vi: độ dài hiển thị output

source: output limit length
vi: giới hạn hiển thị output

source: init.yml generation feedback
vi: phản hồi của quá trình tạo file init.yml

source: checker
vi: trình chấm

source: checker arguments
vi: tham số trong trình chấm

source: checker arguments as a JSON object
vi: tham số trong trình chấm theo dạng JSON

source: custom checker file
vi: trình chấm

source: custom cpp checker file
vi: trình chấm C++

source: interactive judge
vi: trình chấm interactive

source: input file name
vi: tên file input

source: Leave empty for stdin
vi: Để trống nếu nhập từ bàn phím

source: output file name
vi: tên file output

source: Leave empty for stdout
vi: Để trống nếu xuất ra màn hình

source: is output only
vi: Output-only?

source: Support output-only problem
vi: Dùng cho các bài output-only (nộp bằng file zip)

source: is IOI signature
vi: Nộp bài bằng hàm?

source: Use IOI Signature
vi: Nộp bài bằng hàm như IOI

source: signature handler
vi: File xử lý hàm

source: signature header
vi: File định nghĩa hàm

source: problem data set
vi: tập hợp dữ liệu bài

source: case position
vi: vị trí test

source: case type
vi: loại test

source: Normal case
vi: Test bình thường

source: Batch start
vi: Bắt đầu nhóm

source: Batch end
vi: Kết thúc nhóm

source: generator arguments
vi: tham số sinh test

source: point value
vi: điểm

source: case is pretest?
vi: test là pretest?

source: signature language
vi: Ngôn ngữ

source: organization title
vi: tiêu đề nhóm

source: organization slug
vi: URL nhóm

source: Organization name shown in URL
vi: Tên được hiển thị trong đường dẫn

source: Displayed beside user name during contests
vi: Hiển thị bên cạnh tên người dùng trong kỳ thi

source: organization description
vi: mô tả nhóm

source: registrant
vi: người tạo

source: User who registered this organization
vi: Người tạo nhóm

source: administrators
vi: người quản lý

source: Those who can edit this organization
vi: Những người có thể chỉnh sửa nhóm

source: creation date
vi: ngày tạo

source: is open organization?
vi: nhóm mở?

source: Allow joining organization
vi: Cho phép mọi người tham gia nhóm

source: maximum size
vi: số lượng thành viên tối đa

source: Maximum amount of users in this organization, only applicable to private organizations
vi: Số người tối đa trong nhóm, chỉ áp dụng với nhóm riêng tư

source: Student access code
vi: Mã truy cập cho học sinh

source: Organization image
vi: Ảnh nhóm

source: Cover image
vi: Ảnh bìa

source: community
vi: cộng đồng

source: Communities are always open and focus on discussions rather than contests/problems
vi: Cộng đồng luôn mở và tập trung vào thảo luận hơn là kỳ thi/bài tập

source: moderators
vi: người kiểm duyệt

source: Moderators can approve/reject posts and manage comments
vi: Người kiểm duyệt có thể duyệt/từ chối bài đăng và quản lý bình luận

source: organization
vi: tổ chức

source: user associated
vi: người dùng liên kết

source: self-description
vi: mô tả bản thân

source: location
vi: vị trí

source: preferred language
vi: ngôn ngữ ưa thích

source: last access time
vi: lần truy cập cuối

source: last IP
vi: IP cuối

source: display rank
vi: hiển thị xếp hạng

source: comment mute
vi: tắt tiếng bình luận

source: Some users are at their best when silent.
vi: Một số người dùng tốt nhất khi im lặng.

source: unlisted user
vi: người dùng không liệt kê

source: User will not be ranked.
vi: Người dùng sẽ không được xếp hạng.

source: current contest
vi: kỳ thi hiện tại

source: 2FA enabled
vi: 2FA được bật

source: check to enable TOTP-based two factor authentication
vi: đánh dấu để sử dụng TOTP-based two factor authentication

source: TOTP key
vi: mã TOTP

source: 32 character base32-encoded key for TOTP
vi: Khóa 32 ký tự mã hóa base32 cho TOTP

source: TOTP key must be empty or base32
vi: Khóa TOTP phải để trống hoặc là base32

source: internal notes
vi: ghi chú nội bộ

source: Notes for administrators regarding this user.
vi: Ghi chú riêng cho quản trị viên.

source: Profile image
vi: Ảnh đại diện

source: Background image
vi: Ảnh nền

source: user profiles
vi: thông tin người dùng

source: profile associated
vi: trang tương ứng

source: t-shirt size
vi: size áo

source: date of birth
vi: sinh nhật

source: address
vi: địa chỉ

source: request time
vi: thời gian đăng ký

source: state
vi: trạng thái

source: reason
vi: lý do

source: organization join request
vi: đơn đăng ký tham gia

source: organization join requests
vi: đơn đăng ký tham gia

source: last visit
vi: truy cập gần nhất

source: Hide Comment
vi: Ẩn bình luận

source: Unhide Comment
vi: Hiện bình luận

source: Keep Comment
vi: Giữ bình luận

source: Approve Post
vi: Chấp thuận bài đăng

source: Reject Post
vi: Từ chối bài đăng

source: Skipped
vi: Bỏ qua

source: moderator
vi: người kiểm duyệt

source: Null if action was automated by LLM
vi: Null nếu hành động được thực hiện bởi AI

source: content type
vi: loại nội dung

source: object ID
vi: ID đối tượng

source: action
vi: hành động

source: LLM explanation or moderator note
vi: Ghi chú của AI hoặc người kiểm duyệt

source: automated
vi: tự động

source: True if action was taken by LLM
vi: True nếu hành động được thực hiện bởi AI

source: created at
vi: tạo lúc

source: moderation log
vi: nhật ký kiểm duyệt

source: moderation logs
vi: nhật ký kiểm duyệt

source: Multiple Choice
vi: Trắc nghiệm một đáp án

source: Multiple Answer
vi: Trắc nghiệm nhiều đáp án

source: Short Answer
vi: Trả lời ngắn

source: Essay
vi: Tự luận

source: True/False
vi: Đúng/Sai

source: Question Type
vi: Loại câu hỏi

source: Question Title
vi: Tiêu đề câu hỏi

source: Brief title for question management
vi: Tiêu đề ngắn để quản lý câu hỏi

source: Question Content
vi: Nội dung câu hỏi

source: The actual question text shown to students
vi: Nội dung câu hỏi hiển thị cho học sinh

source: Choices
vi: Các lựa chọn

source: Answer choices for MC/MA/TF questions
vi: Các đáp án cho câu hỏi trắc nghiệm

source: Correct Answers
vi: Đáp án đúng

source: Correct answer(s) for the question
vi: Đáp án đúng cho câu hỏi

source: Is Public
vi: Công khai

source: Whether this question is publicly visible
vi: Câu hỏi này có hiển thị công khai hay không

source: Explanation
vi: Giải thích

source: Explanation shown to students after completion
vi: Giải thích hiển thị cho học sinh sau khi hoàn thành

source: Shuffle Choices
vi: Xáo trộn lựa chọn

source: Randomize choice order for this question
vi: Xáo trộn thứ tự các lựa chọn cho câu hỏi này

source: All or Nothing
vi: Tất cả hoặc không

source: Partial Credit (with penalty)
vi: Điểm thành phần (có trừ điểm)

source: Right Minus Wrong
vi: Đúng trừ sai

source: Correct Only (no penalty)
vi: Chỉ tính đúng (không trừ điểm)

source: Grading Strategy
vi: Cách tính điểm

source: How to calculate score for multiple answer questions
vi: Cách tính điểm cho câu hỏi nhiều đáp án

source: Tags
vi: Nhãn

source: Comma-separated tags for categorizing questions
vi: Các nhãn phân cách bằng dấu phẩy để phân loại câu hỏi

source: These users will be able to edit the question and be listed as authors
vi: Những người dùng này có thể chỉnh sửa câu hỏi và được liệt kê là tác giả

source: These users will be able to edit the question, but not be listed as authors
vi: Những người dùng này có thể chỉnh sửa câu hỏi, nhưng không được liệt kê là tác giả

source: Created At
vi: Tạo lúc

source: Quiz Question
vi: Câu hỏi

source: Quiz Questions
vi: Các câu hỏi

source: Quiz code must be ^[a-z0-9]+$
vi: Mã bài kiểm tra phải có dạng ^[a-z0-9]+$

source: quiz code
vi: mã bài kiểm tra

source: A short, unique code for the quiz, used in the URL after /quiz/
vi: Mã ngắn, độc nhất cho bài kiểm tra, được dùng trong URL sau /quiz/

source: Quiz Title
vi: Tiêu đề bài kiểm tra

source: The full title of the quiz, as shown in the quiz list
vi: Tiêu đề đầy đủ của bài kiểm tra, như được hiển thị trên danh sách

source: Instructions or description shown before starting
vi: Hướng dẫn hoặc mô tả hiển thị trước khi bắt đầu

source: Time Limit (minutes)
vi: Giới hạn thời gian (phút)

source: 0 for no time limit
vi: 0 nếu không giới hạn thời gian

source: Shuffle Questions
vi: Xáo trộn câu hỏi

source: Randomize question order for each attempt
vi: Xáo trộn thứ tự câu hỏi cho mỗi lượt làm

source: Show Answers
vi: Hiển thị đáp án

source: Whether answers and explanations are shown to students after submission
vi: Đáp án và giải thích có được hiển thị sau khi nộp bài hay không

source: Questions
vi: Các câu hỏi

source: These users will be able to edit the quiz and be listed as authors
vi: Những người dùng này có thể chỉnh sửa bài kiểm tra và được liệt kê là tác giả

source: These users will be able to edit the quiz, but not be listed as authors
vi: Những người dùng này có thể chỉnh sửa bài kiểm tra, nhưng không được liệt kê là tác giả

source: These users will be able to view and test the quiz, but not edit it
vi: Những người dùng này có thể xem và làm thử bài kiểm tra, nhưng không có quyền chỉnh sửa

source: Whether the quiz is publicly visible to all users
vi: Bài kiểm tra này có được hiển thị công khai cho tất cả người dùng hay không

source: Quizzes
vi: Các bài kiểm tra

source: Points for this question in this quiz
vi: Điểm cho câu hỏi này trong bài kiểm tra

source: Order
vi: thứ tự

source: Display order in quiz (if not shuffled)
vi: Thứ tự hiển thị trong bài kiểm tra (nếu không xáo trộn)

source: Quiz Question Assignment
vi: Gán câu hỏi vào bài kiểm tra

source: Quiz Question Assignments
vi: Các gán câu hỏi vào bài kiểm tra

source: Max Attempts
vi: Số lượt làm tối đa

source: 0 for unlimited attempts
vi: 0 nếu không giới hạn số lượt

source: Lesson Points
vi: Điểm bài học

source: Points awarded in lesson for completing quiz
vi: Điểm được cộng vào bài học khi hoàn thành bài kiểm tra

source: Display order in lesson
vi: Thứ tự hiển thị trong bài học

source: Course Lesson Quiz
vi: Bài kiểm tra trong bài học

source: Course Lesson Quizzes
vi: Các bài kiểm tra trong bài học

source: Attempt Number
vi: Lượt làm thứ

source: Start Time
vi: Thời gian bắt đầu

source: End Time
vi: Thời gian kết thúc

source: When submitted or timed out
vi: Khi nộp bài hoặc hết thời gian

source: Is Submitted
vi: Đã nộp

source: Score
vi: Điểm

source: Max Score
vi: Điểm tối đa

source: Quiz Attempt
vi: Lượt làm bài kiểm tra

source: Quiz Attempts
vi: Các lượt làm bài kiểm tra

source: Student's answer (format depends on question type)
vi: Câu trả lời của học sinh (định dạng tùy thuộc loại câu hỏi)

source: Points awarded for this answer
vi: Điểm cho câu trả lời này

source: Is Correct
vi: Đúng

source: Auto-graded or manually graded result
vi: Kết quả chấm tự động hoặc thủ công

source: Partial Credit
vi: Điểm thành phần

source: 0.0 to 1.0 for partial credit
vi: 0.0 đến 1.0 cho điểm thành phần

source: Instructor feedback for this answer
vi: Nhận xét của giảng viên cho câu trả lời này

source: Answered At
vi: Trả lời lúc

source: Graded At
vi: Chấm điểm lúc

source: Graded By
vi: Chấm bởi

source: Quiz Answer
vi: Câu trả lời

source: Quiz Answers
vi: Các câu trả lời

source: File
vi: Tệp

source: Original Filename
vi: Tên tệp gốc

source: Uploaded At
vi: Tải lên lúc

source: Quiz Answer File
vi: Tệp câu trả lời

source: Quiz Answer Files
vi: Các tệp câu trả lời

source: short identifier
vi: tên ngắn

source: The identifier for this language; the same as its executor id for judges.
vi: Định danh cho ngôn ngữ này; giống với executor id cho máy chấm.

source: long name
vi: tên dài

source: Longer name for the language, e.g. "Python 2" or "C++11".
vi: Tên dài, ví dụ "Python 2" or "C++11".

source: More readable, but short, name to display publicly; e.g. "PY2" or "C++11". If left blank, it will default to the short identifier.
vi: Tên ngắn gọn, dễ đọc để hiển thị công khai; ví dụ "PY2" hoặc "C++11". Nếu để trống, sẽ mặc định sử dụng định danh ngắn.

source: common name
vi: tên thông dụng

source: Common name for the language. For example, the common name for C++03, C++11, and C++14 would be "C++"
vi: Tên chung của ngôn ngữ. Ví dụ, tên chung cho C++03, C++11, và C++14 là "C++"

source: ace mode name
vi: tên chế độ ace

source: Language ID for Ace.js editor highlighting, appended to "mode-" to determine the Ace JavaScript file to use, e.g., "python".
vi: ID ngôn ngữ cho Ace.js editor highlighting, được nối vào "mode-" để xác định file JavaScript Ace cần sử dụng, ví dụ "python".

source: pygments name
vi: tên pygments

source: Language ID for Pygments highlighting in source windows.
vi: ID ngôn ngữ cho tô sáng Pygments trong cửa sổ mã nguồn.

source: code template
vi: template mã nguồn

source: Code template to display in submission editor.
vi: Template mã nguồn hiển thị trong trình soạn thảo bài nộp.

source: runtime info override
vi: ghi đè thông tin runtime

source: Do not set this unless you know what you're doing! It will override the usually more specific, judge-provided runtime info!
vi: Không nên đặt trường này trừ khi bạn biết mình đang làm gì! Nó sẽ ghi đè thông tin runtime từ máy chấm, vốn thường cụ thể hơn!

source: language description
vi: mô tả ngôn ngữ

source: Use this field to inform users of quirks with your environment, additional restrictions, etc.
vi: Sử dụng trường này để thông báo cho người dùng về các đặc điểm riêng của môi trường, các hạn chế bổ sung, v.v.

source: extension
vi: phần mở rộng

source: The extension of source files, e.g., "py" or "cpp".
vi: Phần mở rộng của tệp mã nguồn, ví dụ: "py" hoặc "cpp".

source: languages
vi: ngôn ngữ

source: language to which this runtime belongs
vi: ngôn ngữ mà runtime này thuộc về

source: judge on which this runtime exists
vi: máy chấm mà runtime này tồn tại

source: runtime name
vi: tên runtime

source: runtime version
vi: phiên bản runtime

source: order in which to display this runtime
vi: thứ tự hiển thị runtime này

source: Server name, hostname-style
vi: Tên web

source: time of creation
vi: ngày tạo

source: A key to authenticate this judge
vi: Chìa khóa xác thực

source: authentication key
vi: mã xác thực

source: block judge
vi: chặn máy chấm

source: Whether this judge should be blocked from connecting, even if its key is correct.
vi: Quyết định có chặn máy chấm, ngay cả khi mã xác thực đúng.

source: judge online status
vi: trạng thái online của máy chấm

source: judge start time
vi: thời gian khởi đầu máy chấm

source: response time
vi: thời gian trả lời

source: system load
vi: lưu lượng xử lý

source: Load for the last minute, divided by processors to be fair.
vi: Lưu lượng được chia đều.

source: judges
vi: máy chấm

source: judge
vi: máy chấm

source: Aborted
vi: Đã hủy

source: Queued
vi: Trong hàng đợi

source: Processing
vi: Đang xử lý

source: Grading
vi: Đang chấm

source: Completed
vi: Chấm xong

source: Internal Error (judging server error)
vi: Lỗi máy chấm

source: submission time
vi: thời gian bài nộp

source: execution time
vi: thời gian chạy

source: memory usage
vi: bộ nhớ sử dụng

source: points granted
vi: điểm

source: submission language
vi: ngôn ngữ bài nộp

source: status
vi: trạng thái

source: result
vi: kết quả

source: compile errors
vi: biên dịch lỗi

source: batched cases
vi: nhóm test

source: test case points
vi: điểm test

source: test case total points
vi: tổng điểm các test

source: judged on
vi: chấm trên

source: submission judge time
vi: thời điểm được chấm

source: was rejudged by admin
vi: được chấm lại bởi admin

source: was ran on pretests only
vi: chỉ chấm pretest

source: submissions
vi: bài nộp

source: associated submission
vi: bài nộp tương ứng

source: status flag
vi: cờ trạng thái

source: points possible
vi: điểm có thể đạt được

source: batch number
vi: số thứ tự của nhóm

source: judging feedback
vi: phản hồi từ máy chấm

source: extended judging feedback
vi: phản hồi thêm từ máy chấm

source: program output
vi: output chương trình

source: submission test case
vi: cái testcase trong bài nộp

source: submission test cases
vi: cái testcase trong bài nộp

source: testcase file
vi: bộ test

source: ticket title
vi: tiêu đề báo cáo

source: ticket creator
vi: người báo cáo

source: creation time
vi: thời gian tạo

source: assignees
vi: người được ủy thác

source: quick notes
vi: ghi chú nhanh

source: Staff notes for this issue to aid in processing.
vi: Ghi chú của nhân viên cho vấn đề này để hỗ trợ xử lý.

source: linked item type
vi: loại mục liên kết

source: linked item ID
vi: ID mục liên kết

source: is ticket open?
vi: ticket có mở không?

source: poster
vi: người đăng

source: message time
vi: thời gian tin nhắn

source: Page [page] of [topage]
vi: Trang [page]/[topage]

source: Page %(page)s of %(total)s
vi: Trang %(page)s/%(total)s

source: A username must contain letters, numbers, or underscores
vi: Tên đăng nhập phải chứa ký tự, chữ số, hoặc dấu gạch dưới

source: Sorry, the username is taken.
vi: Xin lỗi, tên đăng nhập đã bị trùng.

source: Choose a username
vi: Chọn tên đăng nhập

source: Create your profile
vi: Khởi tạo thông tin
