Repository: LQDJudge/online-judge
Catalog: locale/*/LC_MESSAGES/django.po
Languages: vi

source: Recalculating contest scores
vi: Tính lại điểm kỳ thi

source: Running MOSS
vi: Đang chạy MOSS

source: Modifying submissions
vi: Chỉnh sửa bài nộp

source: Recalculating user points
vi: Tính lại điểm người dùng

source: Empty batches not allowed.
vi: Nhóm test trống là không hợp lệ.

source: Points must be defined for non-batch case #%d.
vi: Ô điểm số cho test #%d phải được điền.

source: Input file for case %(case_num)d does not exist: %(filename)s
vi: File input cho test %(case_num)d không tồn tại: %(filename)s

source: Output file for case %(case_num)d does not exist: %(filename)s
vi: File output cho test %(case_num)d không tồn tại: %(filename)s

source: Batch start case #%d requires points.
vi: Nhóm test #%d cần được điền điểm số.

source: Attempt to end batch outside of one in case #%d
vi: Nhóm test #%d kết thúc không hợp lệ

source: How did you corrupt the zip path?
vi: Làm sao bạn làm hỏng đường dẫn zip?

source: How did you corrupt the generator path?
vi: Làm sao bạn làm hỏng đường dẫn generator?

source: Invalid interactor judge
vi: Máy chấm tương tác không hợp lệ

source: Invalid signature handler
vi: Trình xử lý không hợp lệ

source: Invalid signature header for C/C++
vi: File định nghĩa hàm không hợp lệ

source: Error
vi: Lỗi

source: Can't pass both queryset and keyword filters
vi: Không thể truyền cả queryset và bộ lọc từ khóa

source: Your password can't be a commonly used password.
vi: Mật khẩu không được quá phổ biến.

source: This password is too common.
vi: Mật khẩu này quá phổ biến.

source: Rate limit exceeded
vi: Vượt quá giới hạn tốc độ

# time format with day
source: %d day %h:%m:%s
vi: %d ngày %h:%m:%s

# time format no seconds with day
source: %d day %h:%m
vi: %d ngày %h:%m

source: %d day
vi: %d ngày

source: M j, Y
vi: j M, Y

source: About
vi: Giới thiệu

source: Contest Format Instructions
vi: Hướng dẫn thể thức kỳ thi

source: Page %d of Posts
vi: Trang %d

source: You must solve at least one problem before you can vote.
vi: Bạn phải giải ít nhất 1 bài trước khi được vote.

source: You already voted.
vi: Bạn đã vote.

source: Edited from site
vi: Chỉnh sửa từ web

source: Editing comment
vi: Chỉnh sửa bình luận

source: Posted comment
vi: Bình luận đã đăng

source: Comment body
vi: Nội dung bình luận

source: Your part is silent, little toad.
vi: Bạn không được phép bình luận.

source: You need to have solved at least one problem before your voice can be heard.
vi: Bạn phải giải ít nhất một bài trước khi được phép bình luận.

source: Comment feed
vi: Bình luận

source: No such contest
vi: Không có contest nào như vậy

source: Could not find a contest with the key "%s".
vi: Không tìm thấy kỳ thi với mã "%s".

source: Contests
vi: Kỳ thi

source: Start time (asc.)
vi: Thời gian bắt đầu (tăng)

source: Start time (desc.)
vi: Thời gian bắt đầu (giảm)

source: Name (asc.)
vi: Tên (tăng)

source: Name (desc.)
vi: Tên (giảm)

source: User count (asc.)
vi: Số lượng tham gia (tăng)

source: User count (desc.)
vi: Số lượng tham gia (giảm)

source: Could not find such contest.
vi: Không tìm thấy kỳ thi nào như vậy.

source: Access to contest "%s" denied
vi: Truy cập tới kỳ thi "%s" bị từ chối

source: Clone Contest
vi: Nhân bản kỳ thi

source: Contest not ongoing
vi: Kỳ thi đang không diễn ra

source: "%s" is not currently ongoing.
vi: "%s" kỳ thi đang không diễn ra.

source: Banned from joining
vi: Bị cấm tham gia

source: You have been declared persona non grata for this contest. You are permanently barred from joining this contest.
vi: Bạn không được phép tham gia kỳ thi này.

source: Enter access code for "%s"
vi: Nhập mật khẩu truy cập cho "%s"

source: You are not in contest "%s".
vi: Bạn không ở trong kỳ thi "%s".

source: ContestCalendar requires integer year and month
vi: Lịch thi yêu cầu giá trị cho năm và tháng là số nguyên

source: Contests in %(month)s
vi: Các kỳ thi trong %(month)s

source: %s Statistics
vi: %s Thống kê

source: %s Rankings
vi: %s Bảng điểm

source: Your participation in %s
vi: Lần tham gia trong %s

source: %(username)s's participation in %(contest)s
vi: Lần tham gia của %(username)s trong %(contest)s

source: Live
vi: Trực tiếp

source: Participation
vi: Lần tham gia

source: %s MOSS Results
vi: %s Kết quả MOSS

source: Running MOSS for %s...
vi: Đang chạy MOSS cho %s...

source: Contest tag: %s
vi: Nhãn kỳ thi: %s

source: Issue description
vi: Mô tả vấn đề

source: New clarification for %s
vi: Thông báo mới cho %s

source: {contest_name} Problemset
vi: Bộ đề thi của {contest_name}

source: Add Course
vi: Thêm khóa học

source: Created course
vi: Đã tạo khóa học

source: Course created successfully.
vi: Khóa học được tạo thành công

source: Edit lessons for %(course_name)s
vi: Chỉnh sửa bài học cho %(course_name)s

source: Edit lessons for <a href='%(url)s'>%(course_name)s</a>
vi: Chỉnh sửa bài học cho <a href='%(url)s'>%(course_name)s</a>

source: Created lesson '{}' in course {}
vi: Đã tạo bài học '{}' trong khóa học {}

source: Assistants cannot delete lessons.
vi: Trợ giảng không thể xóa bài học.

source: Deleted lesson '{}' from course {}
vi: Đã xóa bài học '{}' khỏi khóa học {}

source: Updated lesson '{}' in course {}
vi: Đã cập nhật bài học '{}' trong khóa học {}

source: Grades in %(course_name)s
vi: Điểm trong %(course_name)s

source: Grades in <a href='%(url)s'>%(course_name)s</a>
vi: Điểm trong <a href='%(url)s'>%(course_name)s</a>

source: Grades of %(lesson_name)s in %(course_name)s
vi: Điểm của %(lesson_name)s trong %(course_name)s

source: Grades of <a href='%(url_lesson)s'>%(lesson_name)s</a> in <a href='%(url_course)s'>%(course_name)s</a>
vi: Điểm của <a href='%(url_lesson)s'>%(lesson_name)s</a> trong <a href='%(url_course)s'>%(course_name)s</a>

source: Add contest
vi: Thêm kỳ thi

source: Added from course
vi: Thêm từ khóa học

source: Contest list
vi: Danh sách kỳ thi

source: Edit contests for <a href='%(url)s'>%(course_name)s</a>
vi: Chỉnh sửa kỳ thi cho <a href='%(url)s'>%(course_name)s</a>

source: Edit contest
vi: Chỉnh sửa kỳ thi

source: Edited from course
vi: Chỉnh sửa từ khóa học

source: Edit <a href='%(url)s'>%(contest_name)s</a>
vi: Chỉnh sửa <a href='%(url)s'>%(contest_name)s</a>

source: Clone Lesson
vi: Nhân bản bài học

source: Cloned lesson '{}' to course {}
vi: Đã sao chép bài học '{}' vào khóa học {}

source: Role
vi: Vai trò

source: User does not exist.
vi: Người dùng không tồn tại.

source: User is already a member of this course.
vi: Người dùng đã là thành viên của khóa học này.

source: Assistants can only assign assistant and student roles.
vi: Trợ giảng chỉ có thể phân công vai trò trợ giảng và học viên.

source: Manage members for %(course_name)s
vi: Quản lý học sinh trong %(course_name)s

source: Manage members for <a href='%(url)s'>%(course_name)s</a>
vi: Quản lý học sinh trong <a href='%(url)s'>%(course_name)s</a>

source: Added member '{}' with role {} to course {}
vi: Thêm thành viên '{}' là {} vào khóa học {}

source: User added successfully.
vi: Người dùng được thêm thành công

source: You do not have permission to remove this user.
vi: Bạn không có quyền để xóa người dùng này.

source: Removed member '{}' with role {} from course {}
vi: Xóa thành viên '{} là {} từ khóa học {}

source: Member removed successfully.
vi: Thành viên xóa thành công

source: Member not found.
vi: Thành viên không tìm thấy

source: Invalid role selected.
vi: Vai trò không hợp lệ

source: You do not have permission to manage this user.
vi: Bạn không có quyền để quản lý học sinh này.

source: You do not have permission to assign this role.
vi: Bạn không có quyền để chỉnh sửa vai trò.

source: Updated member '{}'s role from {} to {} in course {}
vi: Cập nhật vai trò của thành viên '{}'s từ {} thành {} trong khóa học {}

source: Updated %(user)s's role from %(old_role)s to %(new_role)s.
vi: Cập nhật %(user)s's vai trò từ %(old_role)s thành %(new_role)s.

source: Current organizations for this course.
vi: Các nhóm hiện tại cho khóa học này.

source: Course Slug
vi: URL khóa học

source: Course name shown in URL (read-only for assistants).
vi: Tên khóa học hiển thị trong URL (chỉ đọc đối với trợ giảng).

source: Publicly Visible
vi: Công khai

source: Whether this course is visible to all users (read-only for assistants).
vi: Khóa học này có hiển thị cho tất cả người dùng hay không (chỉ đọc đối với trợ giảng).

source: Public Registration
vi: Đăng ký công khai

source: Whether users can join this course (read-only for assistants).
vi: Người dùng có thể tham gia khóa học này hay không (chỉ đọc đối với trợ giảng).

source: Course Name
vi: Tên khóa học

source: Course Description
vi: Mô tả khóa học

source: Course Image
vi: Avatar khóa học

source: No organizations
vi: Không có tổ chức nào

source: Yes
vi: Có

source: No
vi: Không

source: Not set
vi: Chưa thiết lập

source: You do not have permission to modify course organizations.
vi: Bạn không có quyền để chỉnh sửa các tổ chức của khóa học.

source: A course with this slug already exists.
vi: Khóa học với url này đã tồn tại.

source: Course name cannot exceed 128 characters.
vi: Tên khóa học không được vượt quá 128 ký tự.

source: Edit Course
vi: Chỉnh sửa khóa học

source: Edit %(course_name)s
vi: Chỉnh sửa %(course_name)s

source: Edit <a href="%(url)s">%(course_name)s</a>
vi: Chỉnh sửa <a href='%(url)s'>%(course_name)s</a>

source: Updated course details for {}
vi: Cập nhật thông tin kỳ thi cho {}

source: Course updated successfully.
vi: Khóa học cập nhật thành công

source: You cannot join this course.
vi: Bạn không thể tham gia khóa học này.

source: You are already enrolled in this course.
vi: Bạn đã đăng ký khóa học này.

source: User '{}' joined course '{}'
vi: Người dùng '{}' đã tham gia khóa học '{}'

source: Successfully joined course: {}
vi: Đã tham gia thành công khóa học: {}

source: You are not enrolled in this course.
vi: Bạn chưa đăng ký khóa học này.

source: Teachers and assistants cannot leave the course. Please contact an administrator.
vi: Giáo viên và trợ giảng không thể rời khóa học. Vui lòng liên hệ quản trị viên.

source: User '{}' left course '{}'
vi: Người dùng '{}' đã rời khóa học '{}'

source: Successfully left course: {}
vi: Đã rời khóa học thành công: {}

source: Unable to leave course.
vi: Không thể rời khóa học.

source: You don't have permission to use the upload feature. Only users who can edit problems are allowed.
vi: Bạn không có quyền sử dụng tính năng tải lên. Chỉ người dùng có thể chỉnh sửa bài tập mới được phép.

source: Maximum number of files reached ({MAX_FILES_PER_USER} files). Please delete some files.
vi: Đã đạt số lượng tệp tối đa ({MAX_FILES_PER_USER} tệp). Vui lòng xóa một số tệp.

source: File size cannot exceed {filesizeformat(max_file_size)}
vi: Kích thước tệp không được vượt quá {filesizeformat(max_file_size)}

source: Storage quota exceeded ({filesizeformat(max_user_storage)} limit). Please delete some files.
vi: Vượt quá hạn mức lưu trữ (giới hạn {filesizeformat(max_user_storage)}). Vui lòng xóa một số tệp.

source: File uploaded successfully!
vi: File đã được tải lên thành công

source: My Files
vi: File của tôi

source: You don't have permission to use the upload feature.
vi: Bạn không có quyền để chỉnh sửa khóa học này.

source: File deleted successfully!
vi: Lời giải đã xóa thành công

source: File not found
vi: Thành viên không tìm thấy

source: New filename cannot be empty
vi: Tên tệp mới không được để trống

source: A file with this name already exists
vi: Mã bài đã tồn tại.

source: File renamed successfully!
vi: Thành viên xóa thành công

source: Failed to rename file
vi: Tên file

source: Test Data Instructions
vi: Hướng dẫn Test Data

source: New Email
vi: Email mới

source: An account with this email already exists.
vi: Email đã được dùng cho tài khoản khác.

source: Email Change Request
vi: Thay đổi Email

source: We have received a request to change your email to this email. Click the button below to change your email:
vi: Chúng tôi đã nhận được yêu cầu thay đổi địa chỉ email của bạn thành địa chỉ email này. Vui lòng nhấp vào nút bên dưới để thay đổi địa chỉ email của bạn:

source: Email Change
vi: Thay đổi Email

source: Change Email
vi: Thay đổi Email

source: Change email
vi: Thay đổi email

source: Success
vi: Thành công

source: Invalid
vi: Không hợp lệ

source: Email change pending
vi: Yêu cầu thay đổi email đang đợi xác thực.

source: 404 error
vi: Lỗi 404

source: Could not find page "%s"
vi: Không thể tìm thấy trang "%s"

source: no permission for %s
vi: không có quyền cho %s

source: corrupt page %s
vi: trang bị sập %s

source: Internal problem queue
vi: Bài trong hàng đợi nội bộ

source: Request times
vi: thời gian đăng ký

source: Markdown Editor
vi: Trình soạn thảo Markdown

source: Notifications (%d unseen)
vi: Thông báo (%d chưa xem)

source: No such organization
vi: Không có nhóm như vậy

source: Could not find an organization with the key %s.
vi: Không tìm thấy nhóm với mã "%s".

source: Could not find such organization.
vi: Không tìm thấy nhóm này

source: Can't edit organization
vi: Không thể chỉnh sửa nhóm

source: You are not allowed to edit this organization.
vi: Bạn không được phép chỉnh sửa nhóm này.

source: Can't access organization
vi: Không thể truy cập nhóm

source: You are not allowed to access this organization.
vi: Bạn không được phép chỉnh sửa nhóm này.

source: Groups
vi: Nhóm

source: Member count (asc.)
vi: Số lượng thành viên (tăng)

source: Member count (desc.)
vi: Số lượng thành viên (giảm)

source: Last visit
vi: Truy cập gần nhất

source: %s Members
vi: %s Thành viên

source: All submissions in <a href="{1}">{0}</a>
vi: Bài nộp trong <a href="{1}">{0}</a>

source: Submissions in
vi: Bài nộp trong

source: Joining group
vi: Tham gia nhóm

source: You are already in the group.
vi: Bạn đã ở trong nhóm.

source: You cannot join since you have already blocked %s.
vi: Bạn không thể tham gia vì bạn đã chặn nhóm %s.

source: This group is not open.
vi: Nhóm này là nhóm kín.

source: You may not be part of more than {count} public groups.
vi: Bạn không thể tham gia nhiều hơn {count} nhóm công khai.

source: Leaving group
vi: Rời nhóm

source: You are not in %s.
vi: Bạn không ở trong "%s".

source: Blocking group
vi: Chặn nhóm

source: You have already blocked %s.
vi: Bạn đã chặn nhóm %s.

source: An error occurred while blocking %(org)s. Reason: %(reason)s
vi: Lỗi hệ thống xảy ra trong quá trình chặn %(org)s. Lý do: %(reason)s.

source: You have not blocked %s.
vi: Bạn chưa chặn nhóm %s.

source: An error occurred while unblocking %(org)s. Reason: %(reason)s
vi: Lỗi hệ thống xảy ra trong quá trình bỏ chặn %(org)s. Lý do: %(reason)s.

source: Request to join group
vi: Đăng ký tham gia %s

source: You cannot request since you have already blocked %s.
vi: Bạn không thể đăng ký vì bạn đã chặn nhóm %s.

source: Request to join %s
vi: Đăng ký tham gia %s

source: Join request detail
vi: Chi tiết đơn đăng ký

source: Manage join requests
vi: Quản lý đơn đăng ký

source: Managing join requests for %s
vi: Quản lý đơn đăng ký cho %s

source: Your organization can only receive %(can_add)d more members. You cannot approve %(to_approve)d users.
vi: Nhóm chỉ có thể chứa thêm %(can_add)d thành viên. Bạn không thể chấp thuận %(to_approve)d người.

source: Approved %d user.
vi: Đã chấp thuận %d người.

source: Rejected %d user.
vi: Đã từ chối %d người.

source: Add member for %s
vi: Thêm thành viên cho %s

source: Added members from site
vi: Thêm thành viên từ web

source: Can't kick user
vi: Không thể đuổi

source: The user you are trying to kick does not exist!
vi: Người dùng bạn đang cố gắng đuổi không tồn tại

source: The user you are trying to kick is not in group: %s.
vi: Người dùng bạn đang cố gắng đuổi không có trong nhóm %s

source: The user you are trying to kick is a group admin.
vi: Người dùng bạn đang cố gắng đuổi là trưởng nhóm.

source: Kicked member
vi: Đuổi thành viên

source: Edit %s
vi: Chỉnh sửa %s

source: Create group
vi: Tạo nhóm

source: Exceeded limit
vi: Quá giới hạn

source: You created too many groups. You can only create at most %d groups
vi: Bạn tạo quá nhiều nhóm. Bạn chỉ có thể tạo tối đa %d nhóm

source: Added from site
vi: Thêm từ web

source: Permission denied
vi: Truy cập bị từ chối

source: You are not allowed to edit this contest
vi: Bạn không được phép chỉnh sửa kỳ thi này.

source: Edit
vi: Chỉnh sửa

source: Add blog for %s
vi: Thêm bài đăng cho %s

source: Your blog post has been submitted successfully and is waiting for admin approval.
vi: Bài đăng của bạn đã được gửi thành công và đang chờ admin phê duyệt.

source: This blog does not belong to this group
vi: Blog này không thuộc về nhóm này

source: Not allowed to edit this blog
vi: Bạn không được phép chỉnh sửa bài đăng này.

source: Cannot edit approved blog posts
vi: Không thể chỉnh sửa bài đăng đã được phê duyệt

source: Blog post not found
vi: Bài đăng không tìm thấy

source: You are not allowed to delete this blog.
vi: Bạn không được phép xóa bài đăng này.

source: Only organization admins and moderators can reject blog posts.
vi: Chỉ quản trị viên và người kiểm duyệt của tổ chức mới có thể từ chối bài đăng.

source: Only organization admins and moderators can approve blog posts.
vi: Chỉ quản trị viên và người kiểm duyệt của tổ chức mới có thể phê duyệt bài đăng.

source: Edit blog %s
vi: Chỉnh sửa %s

source: Rejected blogs in %s
vi: Bài bị từ chối trong %s

source: Pending blogs in %s
vi: Bài đang đợi duyệt trong %s

source: You are not allowed to view moderation logs.
vi: Bạn không được phép xem nhật ký kiểm duyệt.

source: Moderation Log - %s
vi: Nhật ký kiểm duyệt - %s

source: Courses in %s
vi: Khóa học trong %s

source: Invalid value for delta. It must be 1, 0, or -1.
vi: Giá trị delta không hợp lệ. Phải là 1, 0, hoặc -1.

source: Missing 'id' parameter.
vi: Thiếu tham số 'id'.

source: Invalid ID format.
vi: ID không hợp lệ.

source: The specified PageVote does not exist.
vi: PageVote được chỉ định không tồn tại.

source: No such problem
vi: Không có bài nào như vậy

source: Could not find a problem with the code "%s".
vi: Không tìm thấy bài tập với mã bài "%s".

source: Editorial for {0}
vi: Hướng dẫn cho {0}

source: Editorial for <a href="{1}">{0}</a>
vi: Hướng dẫn cho <a href="{1}">{0}</a>

source: Problems
vi: Bài tập

source: Problem feed
vi: Bài tập

source: <h1>You have submitted too many submissions.</h1>
vi: <h1>Bạn nộp quá nhiều bài.</h1>

source: Banned from submitting
vi: Bị cấm nộp bài

source: You have been declared persona non grata for this problem. You are permanently barred from submitting this problem.
vi: Bạn đã bị cấm nộp bài này.

source: Too many submissions
vi: Quá nhiều lần nộp

source: You have exceeded the submission limit for this problem.
vi: Bạn đã vượt quá số lần nộp cho bài này.

source: Submit to %(problem)s
vi: Nộp bài cho %(problem)s

source: Clone Problem
vi: Nhân bản bài tập

source: Edit Problem
vi: Chỉnh sửa bài tập

source: Edit {0}
vi: Chỉnh sửa {0}

source: Editing problem for %s
vi: Chỉnh sửa bài tập cho %s

source: Add Problem
vi: Thêm bài tập

source: Problem '%(name)s' has been created successfully!
vi: Bài tập '%(name)s' đã được tạo thành công!

source: Edit Language Limits - {0}
vi: Chỉnh sửa giới hạn ngôn ngữ - {0}

source: Editing language limits for %s
vi: Chỉnh sửa giới hạn ngôn ngữ cho %s

source: Edit Language Templates - {0}
vi: Chỉnh sửa code mẫu - {0}

source: Editing language templates for %s
vi: Chỉnh sửa code mẫu cho %s

source: Language template deleted successfully.
vi: Đoạn code mẫu được xóa thành công.

source: Language template not found.
vi: Code mẫu không tìm thấy

source: Language template updated successfully.
vi: Đoạn code mẫu được cập nhật thành công

source: Language template added successfully.
vi: Code mẫu được thêm thành công

source: Edit Solutions - {0}
vi: Chỉnh sửa lời giải - {0}

source: Editing solutions for %s
vi: Chỉnh sửa lời giải cho %s

source: Solution deleted successfully.
vi: Lời giải đã xóa thành công

source: Solution not found.
vi: Lời giải không tìm thấy

source: Solution updated successfully.
vi: Lời giải cập nhật thành công

source: A solution already exists for this problem.
vi: Lời giải đã tồn tại cho bài tập này.

source: Solution added successfully.
vi: Lời giải được thêm thành công

source: Edit Translations - {0}
vi: Chỉnh sửa bản dịch - {0}

source: Editing translations for %s
vi: Chỉnh sửa bản dịch cho %s

source: Translation deleted successfully.
vi: Bản dịch cập nhật thành công

source: Translation not found.
vi: Bản dịch không tìm thấy

source: Translation updated successfully.
vi: Bản dịch cập nhật thành công

source: A translation for this language already exists.
vi: Bản dịch với ngôn ngữ này đã tồn tại

source: Translation added successfully.
vi: Bản dịch được thêm thành công

source: Checker arguments must be a JSON object
vi: Tham số checker phải là đối tượng JSON

source: Checker arguments is invalid JSON
vi: Tham số checker là JSON không hợp lệ

source: Your zip file is invalid!
vi: File Zip không hợp lệ!

source: Each language must be unique.
vi: Mỗi ngôn ngữ phải phân biệt

source: Comparing submissions for {0}
vi: So sánh các bài nộp cho {0}

source: Comparing submissions for <a href="{1}">{0}</a>
vi: So sánh các bài nộp cho <a href="{1}">{0}</a>

source: Editing data for {0}
vi: Chỉnh sửa dữ liệu cho {0}

source: Editing data for %s
vi: Chỉnh sửa dữ liệu cho %s

source: Generated init.yml for %s
vi: File init.yml cho %s

source: File size exceeds 50 MB limit. Contact admin for larger uploads.
vi: Kích thước file vượt quá giới hạn 50 MB. Liên hệ admin để tải lên file lớn hơn.

source: Managing submissions for %s
vi: Quản lý bài nộp cho %s

source: Rejudging selected submissions for %s...
vi: Đang chấm lại các bài nộp cho %s...

source: Rescoring all submissions for %s...
vi: Đang tính điểm lại các bài nộp cho %s...

source: Successfully scheduled %d submission for rejudging.
vi: Đã lên lịch chấm lại cho %d bài nộp.

source: You do not have permission to manage quizzes.
vi: Bạn không có quyền để quản lý bài kiểm tra.

source: You do not have permission to edit this question.
vi: Bạn không có quyền để chỉnh sửa câu hỏi này.

source: You do not have permission to edit this quiz.
vi: Bạn không có quyền để chỉnh sửa bài kiểm tra này.

source: Question Bank
vi: Ngân hàng câu hỏi

source: Create Question
vi: Tạo câu hỏi

source: Question created successfully.
vi: Đã tạo câu hỏi thành công.

source: Edit Question: %s
vi: Chỉnh sửa câu hỏi: %s

source: Question updated successfully.
vi: Đã cập nhật câu hỏi thành công.

source: Delete Question: %s
vi: Xóa câu hỏi: %s

source: Cannot delete question. It is used in %d quiz(es).
vi: Không thể xóa câu hỏi. Câu hỏi này đang được sử dụng trong %d bài kiểm tra.

source: Question deleted successfully.
vi: Đã xóa câu hỏi thành công.

source: You do not have permission to view quizzes.
vi: Bạn không có quyền xem các bài kiểm tra.

source: Create Quiz
vi: Tạo bài kiểm tra

source: Quiz created successfully with questions.
vi: Đã tạo bài kiểm tra thành công với các câu hỏi.

source: Quiz created successfully. Now add questions.
vi: Đã tạo bài kiểm tra thành công. Bây giờ hãy thêm câu hỏi.

source: Edit Quiz: %s
vi: Chỉnh sửa bài kiểm tra: %s

source: Quiz updated successfully.
vi: Đã cập nhật bài kiểm tra thành công.

source: Delete Quiz: %s
vi: Xóa bài kiểm tra: %s

source: Quiz deleted successfully.
vi: Đã xóa bài kiểm tra thành công.

source: Successfully regraded %(count)d attempts.
vi: Đã chấm lại %(count)d lượt làm bài thành công.

source: Add Quiz to Lesson
vi: Thêm bài kiểm tra vào bài học

source: Quiz added to lesson successfully.
vi: Đã thêm bài kiểm tra vào bài học thành công.

source: Edit Lesson Quiz Settings
vi: Chỉnh sửa cài đặt bài kiểm tra trong bài học

source: Lesson quiz settings updated.
vi: Đã cập nhật cài đặt bài kiểm tra trong bài học.
